{
    "1": "Mind is the forerunner of (all evil) states. Mind is chief; mind-made are they. If one speaks or acts with wicked mind, because of that, suffering follows one, even as the wheel follows the hoof of the draught-ox.",
    "2": "Mind is the forerunner of (all good) states. Mind is chief; mind-made are they. If one speaks or acts with pure mind, because of that, happiness follows one, even as ones shadow that never leaves.",
    "3": "\"He abused me, he beat me, he defeated me, he robbed me\", in those who harbour such thoughts hatred is not appeased.",
    "4": "\"He abused me, he beat me, he defeated me, he robbed me\", in those who do not harbour such thoughts hatred is appeased.",
    "5": "Hatreds never cease through hatred in this world; through love alone they cease. This is an eternal law.",
    "6": "The others know not that in this quarrel we perish; those of them who realize it, have their quarrels calmed thereby.",
    "7": "Whoever lives contemplating pleasant things, with senses unrestrained, in food immoderate, indolent, inactive, him verily Mara overthrows, as the wind (overthrows) a weak tree.",
    "8": "Whoever lives contemplating \"the Impurities\", with senses restrained, in food moderate, full of faith, full of sustained energy, him Mara overthrows not, as the wind (does not overthrow) a rocky mountain.",
    "9": "Whoever, unstainless, without self control and truthfulness, should don the yellow robe, is not worthy of it.",
    "10": "He who is purged of all stain, is well-established in morals and endowed with self-control and truthfulness, is indeed worthy of the yellow robe.",
    "11": "In the unessential they imagine the essential , in the essential they see the unessential - they who entertain (such) wrong thoughts never realize the essence.",
    "12": "What is essential they regard as essential, what is unessential they regard as unessential - they who entertain (such) right thoughts realize the essence.",
    "13": "Even as rain penetrates as ill-thatched house, so does lust penetrate an undeveloped mind.",
    "14": "Even as rain does not penetrate a well-thatched house, so does lust not penetrate a well-developed mind.",
    "15": "Here he grieves, hereafter he grieves. In both states the evil-doer grieves. He grieves, he is afflicted, perceiving the impurity of his own deeds.",
    "16": "Here he rejoices, hereafter he rejoices. In both states the well-doer rejoices. He rejoices, exceedingly rejoices, perceiving the purity of his own deeds.",
    "17": "Here he suffers, hereafter he suffers. In both states the evil-doer suffers. \"Evil have I done\" (thinking thus), he suffers. Furthermore, he suffers, having gone to a woeful state.",
    "18": "Here he is happy, hereafter he is happy. In both states the well-doer is happy. \"Good have I done\" (thinking thus), he is happy. Furthermore, he is happy, having gone to a blissful state.",
    "19": "Though much he recites the Sacred Texts, but acts not accordingly, that heedless man is like a cowherd who counts others kine. He has no share in the fruits of the Holy Life.",
    "20": "Though little he recites the Sacred Texts, but acts in accordance with the teaching, forsaking lust, hatred and ignorance, truly knowing, with mind well freed, clinging to naught here and hereafter, he shares the fruits of the Holy Life.",
    "21": "Heedfulness is the path to the deathless, heedlessness is the path to death. The heedful do not die; the heedless are like unto the dead.",
    "22": "Distinctly understanding this (difference), the wise (intent) on heedfulness rejoice in heedfulness, delighting in the realm of the Ariyas.",
    "23": "The constantly meditative, the ever steadfast ones realize the bond-free, supreme Nibbana.",
    "24": "The glory of him who is energetic, mindful, pure in deed, considerate, self-controlled, right-living, and heedful steadily increases.",
    "25": "By sustained effort, earnestness, discipline, and self-control let the wise man make for himself an island, which no flood overwhelms.",
    "26": "The ignorant, foolish folk indulge in heedlessness; the wise man guards earnestness as the greatest treasure.",
    "27": "Indulge not in heedlessness; have no intimacy with sensuous delights. Verily, the earnest, meditative person obtains abundant bliss.",
    "28": "When an understanding one discards heedlessness by heedfulness, he, free from sorrow, ascends to the palace of wisdom and surveys the sorrowing folk as a wise mountaineer surveys the ignorant groundlings.",
    "29": "Heedful amongst the heedless, wide awake amongst the slumbering, the wise man advances as does a swift horse, leaving a weak jade behind.",
    "30": "By earnestness Maghava rose to the lordship of the gods. Earnestness is ever praised; negligence is ever despised.",
    "31": "The Bhikkhu who delights in heedfulness, and looks with fear on heedlessness, advances like fire, burning all fetters great and small.",
    "32": "The Bhikkhu who delights in heedfulness, and looks with fear on heedlessness, is not liable to fall. He is in the presence of Nibbana.",
    "33": "The flickering, fickle mind, difficult to guard, difficult to control - the wise person straightens it as a fletcher straightens an arrow.",
    "34": "Like a fish that is drawn from its watery abode and thrown upon land, even so does this mind flutter. Hence should the realm of the passions be shunned.",
    "35": "The mind is hard to check, swift, flits wherever it listeth: to control it is good. A controlled mind is conducive to happiness.",
    "36": "The mind is very hard to perceive, extremely subtle, flits wherever it listeth. Let the wise person guard it; a guarded mind is conducive to happiness.",
    "37": "Faring far, wandering alone, bodiless, lying in a cave, is the mind. Those who subdue it are freed from the bond of Mara.",
    "38": "He whose mind is not steadfast, he who knows not the true doctrine, he whose confidence wavers - the wisdom of such a one will never be perfect.",
    "39": "He whose mind is not soaked (by lust) he who is not affected (by hatred), he who has transcended both good and evil - for such a vigilant one there is no fear.",
    "40": "Realizing that this body is (as fragile) as a jar, establishing this mind (as firm) as a (fortified) city he should attack Mara with the weapon of wisdom. He should guard his conquest and be without attachment.",
    "41": "Before long, alas! this body will lie upon the ground, cast aside, devoid of consciousness, even as a useless charred log.",
    "42": "Whatever (harm) a foe may do to a foe, or a hater to a hater, an ill-directed mind can do one far greater (harm).",
    "43": "What neither mother, nor father, nor any other relative can do, a well-directed mind does and thereby elevates one.",
    "44": "Who will comprehend this earth (self), and this realm of Yama, and this world together with the devas? Who will investigate the well taught Path of Virtue , even as an expert (garland maker) will pick flowers.",
    "45": "A disciple in training (sekha), will comprehend this earth, and this realm of Yama together with the realm of the devas. A disciple in training will investigate the well-taught Path of Virtue even as an expert (garland-maker) will pick flowers.",
    "46": "Knowing that this body is like foam, and comprehending its mirage-nature, one should destroy the flower-shafts of sensual passions (Mara), and pass beyond the sight of the king of death.",
    "47": "The man who gathers flowers (of sensual pleasure), whose mind is distracted, and who is insatiate in desires, the Destroyer brings under his sway.",
    "48": "The man who gathers flowers (of sensual pleasure), whose mind is distracted, death carries off as a great flood sweeps away a sleeping village.",
    "49": "As a bee without harming the flower, its colour or scent, flies away, collecting only the honey, even so should the sage wander in the village.",
    "50": "Let not one seek others faults, things left done and undone by others, but ones own deeds done and undone.",
    "51": "As a flower that is lovely and beautiful but is scentless, even so fruitless is the well-spoken word of one who does not practise it.",
    "52": "As a flower that is lovely, beautiful, and scent-laden, even so fruitful is the well-spoken word of one who practises it.",
    "53": "As from a heap of flowers many a garland is made, even so many good deeds should be done by one born a mortal.",
    "54": "The perfume of flowers blows not against the wind, nor does the fragrance of sandalwood, tagara and jasmine but the fragrance of the virtuous blows against the wind; the virtuous man pervades every direction.",
    "55": "Sandalwood, tagara, lotus, jasmine: above all these kinds of fragrance, the perfume of virtue is by far the best.",
    "56": "Of little account is the fragrance of tagara or sandal; the fragrance of the virtuous, which blows even amongst the gods, is supreme.",
    "57": "Mara finds not the path of those who are virtuous, careful in living, and freed by right knowledge.",
    "58": "As upon a heap of rubbish thrown on the highway, a sweet-smelling lovely lotus may grow,",
    "59": "even so amongst worthless beings, a disciple of the Fully Enlightened One outshines the blind worldlings in wisdom.",
    "60": "Long is the night to the wakeful; long is the league to the weary; long is samsara to the foolish who know not the Sublime Truth.",
    "61": "If, as the disciple fares along, he meets no companion who is better or equal, let him firmly pursue his solitary career. There is no fellowship with the foolish.",
    "62": "\"Sons have I; wealth have I\": Thus is the fool worried. Verily, he himself is not his own. Whence sons? Whence wealth.",
    "63": "The fool who knows that he is a fool is for that very reason a wise man; the fool who thinks that he is wise is called a fool indeed.",
    "64": "Though a fool, through all his life, associates with a wise man, he no more understands the Dhamma than a spoon (tastes) the flavour of soup.",
    "65": "Though an intelligent person, associates with a wise man for only a moment, he quickly understands the Dhamma as the tongue (tastes) the flavour of soup.",
    "66": "Fools of little wit move about with the very self as their own foe, doing evil deeds the fruit of which is bitter.",
    "67": "That deed is not well done when, after having done it, one repents, and when weeping, with tearful face, one reaps the fruit thereof.",
    "68": "That deed is well done when, after having done it, one repents not, and when, with joy and pleasure, one reaps the fruit thereof.",
    "69": "As sweet as honey is an evil deed, so thinks the fool so long as it ripens not; but when it ripens, then he comes to grief.",
    "70": "Month after month a fool may eat only as much food as can be picked up on the tip of a kusa grass blade; but he is not worth a sixteenth part of them who have comprehended the Truth.",
    "71": "Verily, an evil deed committed does not immediately bear fruit, just as milk curdles not at once; smouldering, it follows the fool like fire covered with ashes.",
    "72": "To his ruin, indeed, the fool gains knowledge and fame; they destroy his bright lot and cleave his head.",
    "73": "The fool will desire undue reputation, precedence among monks, authority in the monasteries, honour among other families.",
    "74": "Let both laymen and monks think, \"by myself was this done; in every work, great or small, let them refer to me\". Such is the ambition of the fool; his desires and pride increase.",
    "75": "Surely the path that leads to worldly gain is one, and the path that leads to Nibbana is another; understanding this, the bhikkhu, the disciple of the Buddha, should not rejoice in worldly favours, but cultivate detachment.",
    "76": "Should one see a wise man, who, like a revealer of treasure, points out faults and reproves; let one associate with such a wise person; it will be better, not worse, for him who associates with such a one.",
    "77": "Let him advise, instruct, and dissuade one from evil; truly pleasing is he to the good, displeasing is he to the bad.",
    "78": "Associate not with evil friends, associate not with mean men; associate with good friends, associate with noble men.",
    "79": "He who imbibes the Dhamma abides in happiness with mind pacified; the wise man ever delights in the Dhamma revealed by the Ariyas.",
    "80": "Irrigators lead the waters; fletchers bend the shafts; carpenters bend the wood; the wise control themselves.",
    "81": "As a solid rock is not shaken by the wind, even so the wise are not ruffled by praise or blame.",
    "82": "Just as a deep lake is clear and still, even so, on hearing the teachings, the wise become exceedingly peaceful.",
    "83": "The good give up (attachment for) everything; the saintly prattle not with sensual craving: whether affected by happiness or by pain, the wise show neither elation nor depression.",
    "84": "Neither for the sake of oneself nor for the sake of another (does a wise person do any wrong); he should not desire son, wealth or kingdom (by doing wrong): by unjust means he should not seek his own success. Then (only) such a one is indeed virtuous, wise and righteous.",
    "85": "Few are there amongst men who go Beyond; the rest of mankind only run about on the bank.",
    "86": "But those who act rightly according to the teaching, which is well expounded, those are they who will reach the Beyond - Nibbana - (crossing) the realm of passions, so hard to cross.",
    "87": "Coming from home to the homeless, the wise man should abandon dark states and cultivate the bright.",
    "88": "He should seek great delight in detachment (Nibbana), so hard to enjoy. Giving up sensual pleasures, with no impediments, the wise man should cleanse himself of the impurities of the mind.",
    "89": "Whose minds are well perfected in the Factors of Enlightenment, who, without clinging, delight in \"the giving up of grasping\" (i.e., Nibbana), they, the corruption-free, shining ones, have attained Nibbana even in this world.",
    "90": "For him who has completed the journey, for him who is sorrowless, for him who from everything is wholly free, for him who has destroyed all Ties, the fever (of passion) exists not.",
    "91": "The mindful exert themselves. To no abode are they attached. Like swans that quit their pools, home after home they abandon (and go).",
    "92": "They for whom there is no accumulation, who reflect well over their food, who have Deliverance which is Void and Signless, as their object - their course, like that of birds in the air, cannot be traced.",
    "93": "He whose corruptions are destroyed, he who is not attached to food, he who has Deliverance, which is Void and Signless, as his object - his path, like that of birds in the air, cannot be traced.",
    "94": "He whose senses are subdued, like steeds well-trained by a charioteer, he whose pride is destroyed and is free from the corruptions - such a steadfast one even the gods hold dear.",
    "95": "Like the earth a balanced and well-disciplined person resents not. He is comparable to an Indakhila. Like a pool unsullied by mud, is he; to such a balanced one lifes wanderings do not arise.",
    "96": "Calm is his mind, calm is his speech, calm is his action, who, rightly knowing, is wholly freed, perfectly peaceful, and equipoised.",
    "97": "The man who is not credulous, who understands the Uncreate 18 (Nibbana), who has cut off the links, who has put an end to occasion (of good and evil), who has eschewed all desires, he indeed, is a supreme man.",
    "98": "Whether in village or in forest in vale or on hill, wherever Arahants dwell - delightful, indeed, is that spot.",
    "99": "Delightful are the forests where worldlings delight not; the passionless will rejoice (therein), (for) they seek no sensual pleasures.",
    "100": "Better than a thousand utterances, comprising useless words, is one single beneficial word, by hearing which one is pacified.",
    "101": "Better than a thousand verses, comprising useless words, is one beneficial single line, by hearing which one is pacified.",
    "102": "Should one recite a hundred verses, comprising useless words, better is one single word of the Dhamma, by hearing which one is pacified.",
    "103": "Though one should conquer a million men in battlefield, yet he, indeed, is the noblest victor who has conquered himself.",
    "104": "Self-conquest is, indeed, far greater than the conquest of all other folk;",
    "105": "neither a god nor a gandhabba, nor Mara with Brahma, can win back the victory of such a person who is self-subdued and ever lives in restraint.",
    "106": "Though month after month with a thousand, one should make an offering for a hundred years, yet, if, only for a moment, one should honour (a Saint) who has perfected himself - that honour is, indeed, better than a century of sacrifice.",
    "107": "Though, for a century a man should tend the (sacred) fire in the forest, yet, if, only for a moment, he should honour (a Saint) who has perfected himself - that honour is, indeed, better than a century of fire-sacrifice.",
    "108": "In this world whatever gift or alms a person seeking merit should offer for a year, all that is not worth a single quarter of the reverence towards the Upright which is excellent.",
    "109": "For one who is in the habit of constantly honouring and respecting the elders, four blessings increase - age, beauty, bliss, and strength.",
    "110": "Though one should live a hundred years, immoral and uncontrolled, yet better, indeed, is a single days life of one who is moral and meditative.",
    "111": "Though one should live a hundred years without wisdom and control, yet better, indeed, is a single days life of one who is wise and meditative.",
    "112": "Though one should live a hundred years idle and inactive yet better, indeed, is a single days life of one who makes an intense effort.",
    "113": "Though one should live a hundred years without comprehending how all things rise and pass away, yet better, indeed, is a single days life of one who comprehends how all things rise and pass away.",
    "114": "Though one should live a hundred years without seeing the Deathless State, yet better, indeed, is a single days life of one who sees the Deathless State.",
    "115": "Though one should live a hundred years not seeing the Truth Sublime, yet better, indeed, is a single days life of one who sees the Truth Sublime.",
    "116": "Make haste in doing good; check your mind from evil; for the mind of him who is slow in doing meritorious actions delights in evil.",
    "117": "Should a person commit evil, he should not do it again and again; he should not find pleasure therein: painful is the accumulation of evil.",
    "118": "Should a person perform a meritorious action, he should do it again and again; he should find pleasure therein: blissful is the accumulation of merit.",
    "119": "Even an evil-doer sees good as long as evil ripens not; but when it bears fruit, then he sees the evil results.",
    "120": "Even a good person sees evil so long as good ripens not; but when it bears fruit then the good one sees the good results.",
    "121": "Do not disregard evil, saying, \"It will not come nigh unto me\"; by the falling of drops even a water-jar is filled; likewise the fool, gathering little by little, fills himself with evil.",
    "122": "Do not disregard merit, saying \"It will not come nigh unto me\"; by the falling of drops even a water-jar is filled; likewise the wise man, gathering little by little, fills himself with good.",
    "123": "Just as a merchant, with a small escort and great wealth, avoids a perilous route, just as one desiring to live avoids poison, even so should one shun evil things.",
    "124": "If no wound there be in ones hand, one may carry poison in it. Poison does not affect one who has no wound. There is no ill for him who does no wrong.",
    "125": "Whoever harms a harmless person, one pure and guiltless, upon that very fool the evil recoils like fine dust thrown against the wind.",
    "126": "Some are born in a womb; evil-doers (are born) in woeful states; the well-conducted go to blissful states; the Undefiled Ones pass away into Nibbàna.",
    "127": "Not in the sky, nor in mid-ocean, nor in a mountain cave, is found that place on earth where abiding one may escape from (the consequences) of ones evil deed.",
    "128": "Not in the sky, nor in mid-ocean, nor in a mountain cave, is found that place on earth where abiding one will not be overcome by death.",
    "129": "All tremble at the rod. All fear death. Comparing others with oneself, one should neither strike nor cause to strike.",
    "130": "All tremble at the rod. Life is dear to all. Comparing others with oneself, one should neither strike nor cause to strike.",
    "131": "Whoever, seeking his own happiness, harms with the rod other pleasure-loving beings experiences no happiness hereafter.",
    "132": "Whoever, seeking his own happiness, harms not with the rod other pleasure-loving beings, experiences happiness hereafter.",
    "133": "Speak not harshly to anyone. Those thus addressed will retort. Painful, indeed, is vindictive speech. Blows in exchange may bruise you.",
    "134": "If, like a cracked gong, you silence yourself, you have already attained Nibbàna: no vindictiveness will be found in you.",
    "135": "As with a staff the herdsmen drives his kine to pasture, even so do old age and death drive out the lives of beings.",
    "136": "So, when a fool does wrong deeds, he does not realize (their evil nature); by his own deeds the stupid man is tormented, like one burnt by fire.",
    "137": "He who with the rod harms the rodless and harmless, soon will come to one of these states:.",
    "138": "He will be subject to acute pain, disaster, bodily injury, or even grievous sickness, or loss of mind,",
    "139": "or oppression by the king, or heavy accusation, or loss of relatives, or destruction of wealth, or ravaging fire that will ",
    "140": "burn his house. Upon the dissolution of the body such unwise man will be born in hell.",
    "141": "Not wandering naked, nor matted locks, nor filth, nor fasting, nor lying on the ground, nor dust, nor ashes, nor striving squatting on the heels, can purify a mortal who has not overcome doubts. ",
    "142": "Though gaily decked, if he should live in peace, (with passions) subdued, (and senses) controlled, certain (of the four Paths of Sainthood), perfectly pure, laying aside the rod (in his relations) towards all living beings, a Bràhmaua indeed is he, an ascetic is he, a bhikkhu is he.",
    "143": "(Rarely) is found in this world anyone who, restrained by modesty, avoids reproach, as a thorough-bred horse (avoids) the whip.",
    "144": "Like a thorough-bred horse touched by the whip, even so be strenuous and zealous. By confidence, by virtue, by effort, by concentration, by investigation of the Truth, by being endowed with knowledge and conduct, and by being mindful, get rid of this great suffering.",
    "145": "Irrigators lead the waters. Fletchers bend the shafts. Carpenters bend the wood. The virtuous control themselves.",
    "146": "What is laughter, what is joy, when the world is ever burning? Shrouded by darkness, would you not seek the light.",
    "147": "Behold this beautiful body, a mass of sores, a heaped-up (lump), diseased, much thought of, in which nothing lasts, nothing persists.",
    "148": "Thoroughly worn out is this body, a nest of diseases, perishable. This putrid mass breaks up. Truly, life ends in death.",
    "149": "Like gourds cast away in autumn are these dove-hued bones. What pleasure is there in looking at them.",
    "150": "Of bones is (this) city made, plastered with flesh and blood. Herein are stored decay, death, conceit, and detraction.",
    "151": "Even ornamented royal chariots wear out. So too the body reaches old age. But the Dhamma of the Good grows not old. Thus do the Good reveal it among the Good.",
    "152": "The man of little learning grows old like the ox. His muscles grow; his wisdom grows not.",
    "153": "Through many a birth I wandered in samsàra, seeking, but not finding, the builder of the house. Sorrowful is it to be born again and again.",
    "154": "O house-builder! Thou art seen. Thou shalt build no house again. All thy rafters are broken. Thy ridge-pole is shattered. My mind has attained the unconditioned. Achieved is the end of craving.",
    "155": "They who have not led the Holy Life, who in youth have not acquired wealth, pine away like old herons at a pond without fish.",
    "156": "They who have not led the Holy Life; who in youth have not acquired wealth, lie like worn-out bows, sighing after the past.",
    "157": "If one holds oneself dear, one should protect oneself well. During every one of the three watches the wise man should keep vigil.",
    "158": "Let one first establish oneself in what is proper, and then instruct others. Such a wise man will not be defiled.",
    "159": "As he instructs others so should he himself act. Himself fully controlled, he should control (others); for oneself, indeed, is difficult to control.",
    "160": "Oneself, indeed, is ones saviour, for what other saviour would there be? With oneself well controlled one obtains a saviour difficult to find.",
    "161": "By oneself alone is evil done; it is self-born, it is self-caused. Evil grinds the unwise as a diamond grinds a hard gem.",
    "162": "He who is exceedingly corrupt, like a màluvà creeper strangling a sal tree, does to himself what even an enemy would wish for him.",
    "163": "Easy to do are things that are hard and not beneficial to oneself, but very, very, difficult indeed, to do is that which is beneficial and good.",
    "164": "The stupid man, who, on account of false views, scorns the teaching of the Arahants, the Noble Ones, and the Righteous, ripens like the fruit of the kàshta reed, only for his own destruction.",
    "165": "By oneself, indeed, is evil done; by oneself is one defiled. By oneself is evil left undone; by oneself indeed, is one purified. Purity and impurity depend on oneself. No one purifies another.",
    "166": "For the sake of others welfare, however great, let not one neglect ones own welfare. Clearly perceiving ones own welfare, let one be intent on ones own goal.",
    "167": "Do not serve mean ends, Do not live in heedlessness. Do not embrace false views. Do not be a world-upholder.",
    "168": "Be not heedless in standing (at peoples doors for alms). Observe (this) practice scrupulously. He who observes this practice lives happily both in this world and in the next.",
    "169": "Scrupulously observe (this) practice. Do not observe it unscrupulously. He who observes this practice lives happily both in this world and in the next.",
    "170": "Just as one would look upon a bubble, just as one would look upon a mirage - if a person thus looks upon the world, the King of Death sees him not.",
    "171": "Come, behold this world which is like unto an ornamented royal chariot, wherein fools flounder, but for the wise there is no attachment.",
    "172": "Whoever was heedless before and afterwards is not; such a one illumines this world like the moon freed from clouds.",
    "173": "Whoever, by a good deed, covers the evil done, such a one illumines this world like the moon freed from clouds.",
    "174": "Blind is this world. Few are those who clearly see. As birds escape from a net few go to a blissful state.",
    "175": "Swans wing along on the path of the sun. (Men) go through air by psychic powers, The wise are led away from the world, having conquered Màra and his host.",
    "176": "There is no evil that cannot be done by the liar, who has transgressed the one law (of truthfulness) and who is indifferent to a world beyond.",
    "177": "Verily misers go not to the celestial realms. Fools do not indeed praise liberality. The wise man rejoices in giving and thereby become happy thereafter.",
    "178": "Better than absolute sovereignty over the earth, better than going to heaven, better than even lordship over all the worlds, is the Fruit of a Stream-Winner.",
    "179": "Whose conquest (of passion) is not turned into defeat, no conquered (passion) of his in this world follows him - that trackless Buddha of infinite range, by which way will you lead him.",
    "180": "Him in whom there is not that entangling, embroiling craving to lead (to any life), him the trackless Buddha of infinite range - by which way will you lead him.",
    "181": "The wise ones who are intent on meditation, who delight in the peace of renunciation (i.e., Nibbàna), such mindful perfect Buddhas even the gods hold (most) dear.",
    "182": "Rare is birth as a human being. Hard is the life of mortals. Hard is the hearing of the Sublime Truth. Rare is the appearance of the Buddhas.",
    "183": "Not to do any evil, to cultivate good, to purify ones mind, this is the Teaching of the Buddhas.",
    "184": "Forbearing patience is the highest austerity. Nibbàna is supreme, say the Buddhas. He, verily, is not a recluse who harms another. Nor is he an ascetic who oppresses others.",
    "185": "Not insulting, not harming, restraint according to the Fundamental Moral Code, moderation in food, secluded abode, intent on higher thoughts, - this is the Teaching of the Buddhas.",
    "186": "Not by a shower of gold coins does contentment arise in sensual pleasures. Of little sweetness, and painful, are sensual pleasures.",
    "187": "Knowing thus, the wise man finds no delight even in heavenly pleasures. The disciple of the Fully Enlightened One delights in the destruction of craving.",
    "188": "To many a refuge fear-stricken men betake themselves - to hills, woods, groves, trees, and shrines.",
    "189": "Nay no such refuge is safe, no such refuge is supreme. Not by resorting to such a refuge is one freed from all ill.",
    "190": "He who has gone for refuge to the Buddha, the Dhamma, and the Sangha, sees with right knowledge the four Noble Truths - ",
    "191": "Sorrow, the Cause of Sorrow, the Transcending of Sorrow, and the Noble Eightfold Path which leads to the Cessation of Sorrow - ",
    "192": "This, indeed, is refuge secure. This, indeed, is refuge supreme. By seeking such refuge one is released from all sorrow.",
    "193": "Hard to find is a man of great wisdom: such a man is not born everywhere. Where such a wise man is born, that family thrives happily.",
    "194": "Happy is the birth of Buddhas. Happy is the teaching of the sublime Dhamma. Happy is the unity of the Sangha. Happy is the discipline of the united ones.",
    "195": "He who reverences those worthy of reverence, whether Buddhas or their disciples; those who have overcome the impediments and have got rid of grief and lamentation - ",
    "196": "the merit of him who reverences such peaceful and fearless Ones cannot be measured by anyone as such and such.",
    "197": "Ah, happily do we live without hate amongst the hateful; amidst hateful men we dwell unhating.",
    "198": "Ah, happily do we live in good health amongst the ailing; amidst ailing men we dwell in good health.",
    "199": "Ah, happily do we live without yearning (for sensual pleasures) amongst those who yearn (for them); amidst those who yearn (for them) we dwell without yearning.",
    "200": "Ah, happily do we live we who have no impediments. Feeders of joy shall we be even as the gods of the Radiant Realm.",
    "201": "Victory breeds hatred. The defeated live in pain. Happily the peaceful live, giving up victory and defeat.",
    "202": "There is no fire like lust, no crime like hate. There is no ill like the body, no bliss higher than Peace (Nibbàna).",
    "203": "Hunger is the greatest disease. Aggregates are the greatest ill. Knowing this as it really is, (the wise realize) Nibbàna, bliss supreme.",
    "204": "Health is the highest gain. Contentment is the greatest wealth. The trusty are the best kinsmen. Nibbàna is the highest bliss.",
    "205": "Having tasted the flavour of seclusion and the flavour of appeasement, free from anguish and stain becomes he, imbibing the taste of the joy of the Dhamma.",
    "206": "Good is the sight of the Ariyas: their company is ever happy. Not seeing the foolish, one may ever be happy.",
    "207": "Truly he who moves in company with fools grieves for a long time. Association with the foolish is ever painful as with a foe. Happy is association with the wise, even like meeting with kinsfolk.",
    "208": "Therefore: With the intelligent, the wise, the learned, the enduring, the dutiful, and the Ariya - with a man of such virtue and intellect should one associate, as the moon (follows) the starry path.",
    "209": "Applying oneself to that which should be avoided, not applying oneself to that which should be pursued, and giving up the quest, one who goes after pleasure envies them who exert themselves.",
    "210": "Consort not with those that are dear, never with those that are not dear; not seeing those that are dear and seeing those that are not dear, are both painful.",
    "211": "Hence hold nothing dear, for separation from those that are dear is bad; bonds do not exist or those to whom naught is dear or not dear.",
    "212": "From endearment springs grief, from endearment springs fear; for him who is wholly free from endearment there is no grief, much less fear.",
    "213": "From affection springs grief, from affection springs fear; for him who is wholly free from affection there is no grief, much less fear.",
    "214": "From attachment springs grief, from attachment springs fear; for him who is wholly free from attachment there is no grief, much less fear.",
    "215": "From lust springs grief, from lust springs fear; for him who is wholly free from lust there is no grief, much less fear.",
    "216": "From craving springs grief, from craving springs fear; for him who is wholly free from craving there is no grief, much less fear.",
    "217": "Whoso is perfect in virtue, and insight, is established in the Dhamma, has realized the Truths, and fulfils his own duties - him do folk hold dear.",
    "218": "He who has developed a wish for the Undeclared (Nibbàna), he whose mind is thrilled (with the three Fruits), he whose mind is not bound by material pleasures, such a person is called an \"Upstream-bound One\".",
    "219": "A man long absent and returned safe from afar, his kinsmen, friends, and well-wishers welcome on his arrival.",
    "220": "Likewise, his good deeds will receive the well-doer who has gone from this world to the next, as kinsmen will receive a dear one on his return.",
    "221": "One should give up anger. One should abandon pride. One should overcome all fetters. Ills never befall him who clings not to mind and body and is passionless.",
    "222": "Whoso checks his uprisen anger as though it were a rolling chariot, him I call a true charioteer. Other charioteers are mere rein-holders.",
    "223": "Conquer anger by love. Conquer evil by good. Conquer the stingy by giving. Conquer the liar by truth.",
    "224": "One should utter the truth. One should not be angry. One should give even from a scanty store to him who asks. Along these three paths one may go to the presence of the gods.",
    "225": "Those sages who are harmless, and are ever restrained in body, go to the deathless state (Nibbàna), whither gone they never grieve.",
    "226": "The defilements of those who are ever vigilant, who discipline themselves day and night, who are wholly intent on Nibbàna, are destroyed.",
    "227": "This, O Atula, is an old saying; it is not one of today only: they blame those who sit silent, they blame those who speak too much. Those speaking little too they blame. There is no one who is not blamed in this world.",
    "228": "There never was, there never will be, nor does there exist now, a person who is wholly blamed or wholly praised.",
    "229": "Examining day by day, the wise praise him who is of flawless life, intelligent, endowed with knowledge and virtue.",
    "230": "Who deigns to blame him who is like a piece of refined gold? Even the gods praise him; by Brahma too he is praised.",
    "231": "One should guard against misdeeds (caused by) the body, and one should be restrained in body. Giving up evil conduct in body, one should be of good bodily conduct.",
    "232": "One should guard against misdeeds (caused by) speech, and one should be restrained in speech. Giving up evil conduct in speech, one should be of good conduct in speech.",
    "233": "One should guard against misdeeds (caused by) the mind, and one should be restrained in mind. Giving up evil conduct in mind, one should be of good conduct in mind.",
    "234": "The wise are restrained in deed; in speech, too, they are restrained. The wise, restrained in mind, are indeed those who are perfectly restrained.",
    "235": "Like a withered leaf are you now. The messengers of death wait on you. On the threshold of decay you stand. Provision too there is none for you.",
    "236": "Make an island unto yourself. Strive quickly; become wise. Purged of stain and passionless, you shall enter the heavenly stage of the Ariyas.",
    "237": "Your life has come to an end now. To the presence of death you are setting out. No halting place is there for you by the way. Provision too there is none for you.",
    "238": "Make an island unto yourself. Strive without delay; become wise. Purged of stain and passionless, you will not come again to birth and old age.",
    "239": "By degrees, little by little, from time to time, a wise person should remove his own impurities, as a smith removes (the dross) of silver.",
    "240": "As rust sprung from iron eats itself away when arisen, even so his own deeds lead the transgressor to states of woe.",
    "241": "Non-recitation is the rust of incantations; non-exertion is the rust of homes; sloth is the taint of beauty; carelessness is the flaw of a watcher.",
    "242": "Misconduct is the taint of a woman. Stinginess is the taint of a donor. Taints, indeed, are all evil things both in this world and in the next.",
    "243": "A worse taint than these is ignorance, the greatest taint. Abandoning this taint, be taintless, O Bhikkhus.",
    "244": "Easy is the life of a shameless one who is as impudent as a crow, back-biting, presumptuous, arrogant, and corrupt.",
    "245": "Hard is the life of a modest one who ever seeks purity, is detached, humble, clean in life, and reflective.",
    "246": "Whoso in this world destroys life, tells lies, takes what is not given, goes to others wive",
    "247": "and is addicted to intoxicating drinks, such a one digs up his own root in this world.",
    "248": "Know thus O good man: \"Not easy of restraint are evil things\". Let not greed and wickedness drag you to protracted misery.",
    "249": "People give according to their faith and as they are pleased. Whoever therein is envious of others food and drink, gains no peace either by day or by night.",
    "250": "But he who has this (feeling) fully cut off, uprooted and destroyed, gains peace by day and by night.",
    "251": "There is no fire like lust, no grip like hate, no net like delusion, no river like craving.",
    "252": "Easily seen are others faults, hard indeed to see are ones own. Like chaff one winnows others faults, but ones own (faults) one hides, as a crafty fowler conceals himself by camouflage.",
    "253": "He who sees others faults, and is ever irritable - the corruptions of such a one grow. He is far from the destruction of corruptions.",
    "254": "In the sky there is no track. Outside there is no Saint. Mankind delights in obstacles. The Tathàgatas are free from obstacles.",
    "255": "In the sky there is no track. Outside there is no Saint. There are no conditioned things that are eternal. There is no instability in the Buddhas.",
    "256": "He is not thereby just because he hastily arbitrates cases. The wise man should investigate both right and wrong.",
    "257": "The intelligent person who leads others not falsely but lawfully and impartially, who is a guardian of the law, is called one who abides by the law (dhammaññha).",
    "258": "One is not thereby a learned man merely because one speaks much. He who is secure, without hate, and fearless is called \"learned\".",
    "259": "One is not versed in the Dhamma merely because one speaks too much. He who hears little and sees the Dhamma mentally, and who does not neglect the Dhamma, is, indeed, versed in the Dhamma.",
    "260": "He is not thereby an elder (thera) merely because his head is grey. Ripe is he in age. \"Old-in-vain\" is he called.",
    "261": "In whom are truth, virtue, harmlessness, restraint and control, that wise man who is purged of impurities, is, indeed, called an elder.",
    "262": "Not by mere eloquence, nor by handsome appearance, does a man become good-natured, should he be jealous, selfish, and deceitful.",
    "263": "But in whom these are wholly cut off, uprooted and extinct, that wise man who is purged of hatred, is, indeed, called good-natured.",
    "264": "Not by a shaven head does an undisciplined man, who utters lies, become a monk. How will one who is full of desire and greed be a monk.",
    "265": "He who wholly subdues evil deeds both small and great is called a monk because he has overcome all evil.",
    "266": "He is not thereby a bhikkhu merely because he begs from others; by following the whole code (of morality) one certainly becomes a bhikkhu and not (merely) by such begging.",
    "267": "Herein he who has transcended both good and evil, whose conduct is sublime, who lives with understanding in this world, he, indeed, is called a bhikkhu.",
    "268": "Not by silence (alone) does he who is dull and ignorant become a sage; but that wise man who, as if holding a pair of scales, embraces the best and shuns evil, is indeed a sage.",
    "269": "For that reason he is a sage. He who understands, both worlds is, therefore, called a sage.",
    "270": "He is not therefore an Ariya (Noble) in that he harms living beings; through his harmlessness towards all living beings is he called an Ariya (Noble).",
    "271": "Not only by mere morality and austerities, nor again by much learning, nor even by developing mental concentration, nor by secluded lodging,",
    "272": "(thinking) \"I enjoy the bliss of renunciation not resorted to by the worldling\" (not with these) should you, O bhikkhu, rest content without reaching the extinction of the corruptions.",
    "273": "The best of paths is the Eightfold Path. The best of truths are the four Sayings. Non-attachment is the best of states. The best of bipeds is the Seeing One.",
    "274": "This is the only Way. There is none other for the purity of vision. Do you follow this path. This is the bewilderment of Màra.",
    "275": "Entering upon that path, you will make an end of pain. Having learnt the removal of thorns, have I taught you the path.",
    "276": "Striving should be done by yourselves; the Tathàgatas are only teachers. The meditative ones, who enter the way, are delivered from the bonds of Màra.",
    "277": "\"Transient are all conditioned things\": when this, with wisdom, one discerns, then is one disgusted with ill; this is the path to purity.",
    "278": "\"Sorrowful are all conditioned things\": when this, with wisdom, one discerns, then is one disgusted with ill; this is the path to purity.",
    "279": "\"All Dhammas are without a soul\": when this, with wisdom, one discerns, then is one disgusted with ill; this is the path to purity.",
    "280": "The inactive idler who strives not when he should strive, who, though young and strong, is slothful, with (good) thoughts depressed, does not by wisdom realize the Path.",
    "281": "Watchful of speech, well restrained in mind, let him do nought unskilful through his body. Let him purify these three ways of action and win the path realized by the sages.",
    "282": "Verily, from meditation arises wisdom. Without meditation wisdom wanes. Knowing this twofold path of gain and loss, let one so conduct oneself that wisdom may increase.",
    "283": "Cut down the forest (of the passions), but not real trees. From the forest (of the passions) springs fear. Cutting down both forest and brushwood (of the passions), be forestless, O bhikkhus.",
    "284": "For as long as the slightest brushwood (of the passions) of man towards women is not cut down, so long is his mind in bondage, like the milch calf to its mother-cow.",
    "285": "Cut off your affection, as though it were an autumn lily, with the hand. Cultivate the very path of peace. Nibbàna has been expounded by the Auspicious One.",
    "286": "Here will I live in the rainy season, here in the autumn and in the summer: thus muses the fool. He realizes not the danger (of death).",
    "287": "The doting man with mind set on children and herds, death seizes and carries away, as a great flood (sweeps away) a slumbering village.",
    "288": "There are no sons for ones protection, neither father nor even kinsmen; for one who is overcome by death no protection is to be found among kinsmen.",
    "289": "Realizing this fact, let the virtuous and wise person swiftly clear the way that leads to Nibbàna.",
    "290": "If by giving up a lesser happiness, one may behold a greater one, let the wise man give up the lesser happiness in consideration of the greater happiness.",
    "291": "He who wishes his own happiness by causing pain to others is not released from hatred, being himself entangled in the tangles of hatred.",
    "292": "What should have been done is left undone, what should not have been done is done. Of those who are puffed up and heedless the corruptions increase.",
    "293": "Those who always earnestly practise \"mindfulness of the body\", who follow not what should not be done, and constantly do what should be done, of those mindful and reflective ones the corruptions come to an end.",
    "294": "Having slain mother (craving) and father (conceit) and two warrior kings (views based on eternalism and nihilism), and having destroyed a country (sense-avenues and sense-objects) together with its revenue officer (attachment), ungrieving goes the Bràhmaua (Arahant).",
    "295": "Having slain mother and father and two brahmin kings, and having destroyed the perilous path (hindrances), ungrieving goes the Bràhmaua (Arahant).",
    "296": "Well awakened the disciples of Gotama ever arise - they who by day and night always contemplate the Buddha.",
    "297": "Well awakened the disciples of Gotama ever arise - they who by day and night always contemplate the Dhamma.",
    "298": "Well awakened the disciples of Gotama ever arise - they who by day and night always contemplate the Sangha.",
    "299": "Well awakened the disciples of Gotama ever arise - they who by day and night always contemplate the body.",
    "300": "Well awakened the disciples of Gotama ever arise - they who by day and night delight in harmlessness.",
    "301": "Well awakened the disciples of Gotama ever arise - they who by day and night delight in meditation.",
    "302": "Difficult is renunciation, difficult is it to delight therein. Difficult and painful is household life. Painful is association with those who are incompatible. Ill befalls a wayfarer (in samsàra). Therefore be not a wayfarer, be not a pursuer of ill.",
    "303": "He who is full of confidence and virtue, possessed of fame and wealth, he is honoured everywhere, in whatever land he sojourns.",
    "304": "Even from afar like the Himalaya mountain the good reveal themselves. The wicked, though near, are invisible like arrows shot by night.",
    "305": "He who sits alone, rests alone, walks alone, unindolent, who in solitude controls himself, will find delight in the forest.",
    "306": "The speaker of untruth goes to a woeful state, and also he who, having done aught, says, \"I did not\". Both after death become equal, men of base actions in the other world.",
    "307": "Many with a yellow robe on their necks are of evil disposition and uncontrolled. Evil-doers on account of their evil deeds are born in a woeful state.",
    "308": "Better to swallow a red-hot iron ball (which would consume one) like a flame of fire, than to be an immoral and uncontrolled person feeding on the alms offered by people. ",
    "309": "Four misfortunes befall a careless man who commits adultery: acquisition of demerit, disturbed sleep, thirdly blame, and fourthly a state of woe.",
    "310": "There is acquisition of demerit as well as evil destiny. Brief is the joy of the frightened man and woman. The King imposes a heavy punishment. Hence no man should frequent anothers wife.",
    "311": "Just as kusa grass, wrongly grasped, cuts the hand, even so the monkhood wrongly handled drags one to a woeful state.",
    "312": "Any loose act, any corrupt practice, a life of dubious holiness - none of these is of much fruit.",
    "313": "If aught should be done, let one do it. Let one promote it steadily, for slack asceticism scatters dust all the more.",
    "314": "An evil deed is better not done: a misdeed torments one hereafter. Better it is to do a good deed, after doing which one does not grieve.",
    "315": "Like a border city, guarded within and without, so guard yourself. Do not let slip this opportunity, for they who let slip the opportunity grieve when born in a woeful state.",
    "316": "Beings who are ashamed of what is not shameful, and are not ashamed of what is shameful, embrace wrong views and go to a woeful state.",
    "317": "Beings who see fear in what is not to be feared, and see no fear in the fearsome, embrace false views and go to a woeful state.",
    "318": "Beings who imagine faults in the faultless, and perceive no wrong in what is wrong, embrace false views and go to a woeful state.",
    "319": "Beings knowing wrong as wrong and what is right as right, embrace right views and go to a blissful state.",
    "320": "As an elephant in the battlefield withstands the arrows shot from a bow, even so will I endure abuse; verily most people are undisciplined.",
    "321": "They lead the trained (horses or elephants) to an assembly. The king mounts the trained animal. Best among men are the trained who endure abuse.",
    "322": "Excellent are trained mules, so are thoroughbred horses of Sindh and noble tusked elephants; but far better is he who has trained himself.",
    "323": "Surely never by those vehicles would one go to the untrodden land (Nibbàna) as does one who is controlled through his subdued and well-trained self.",
    "324": "The uncontrollable, captive tusker named Dhanapàlaka, with pungent juice flowing, eats no morsel; the tusker calls to mind the elephant forest.",
    "325": "The stupid one, when he is torpid, gluttonous, sleepy, rolls about lying like a great hog nourished on pig-wash, goes to rebirth again and again.",
    "326": "Formerly this mind went wandering where it liked, as it wished and as it listed. Today with attentiveness I shall completely hold it in check, as a mahout (holds in check) an elephant in must.",
    "327": "Take delight in heedfulness. Guard your mind well. Draw yourselves out of the evil way as did the elephant sunk in the mire.",
    "328": "If you get a prudent companion (who is fit) to live with you, who behaves well and is wise, you should live with him joyfully and mindfully, overcoming all dangers.",
    "329": "If you do not get a prudent companion who (is fit) to live with you, who behaves well and is wise, then like a king who leaves a conquered kingdom, you should live alone as an elephant does in the elephant forest.",
    "330": "Better it is to live alone. There is no fellowship with the ignorant. Let one live alone doing no evil, care-free, like an elephant in the elephant forest.",
    "331": "When need arises, pleasant (is it to have) friends. Pleasant is it to be content with just this and that. Pleasant is merit when life is at an end. Pleasant is the shunning of all ill.",
    "332": "Pleasant in this world is ministering to mother. Ministering to father too is pleasant in this world. Pleasant is ministering to ascetics. Pleasant too is ministering to the Noble Ones.",
    "333": "Pleasant is virtue (continued) until old age. Pleasant is steadfast confidence. Pleasant is the attainment of wisdom. Pleasant is it to do no evil.",
    "334": "The craving of the person addicted to careless living grows like a creeper. He jumps from life to life like a fruit-loving monkey in the forest.",
    "335": "Whomsoever in this world this base clinging thirst overcomes, his sorrows flourish like well-watered bãraua grass.",
    "336": "Whoso in the world overcomes this base unruly craving, from him sorrows fall away like water-drops from a lotus-leaf.",
    "337": "This I say to you: Good luck to you all who have assembled here! Dig up the root of craving like one in quest of bãrauas sweet root. Let not Màra crush you again and again as a flood (crushes) a reed.",
    "338": "Just as a tree with roots unharmed and firm, though hewn down, sprouts again, even so while latent craving is not rooted out, this sorrow springs up again and again.",
    "339": "If in anyone the thirty-six streams (of craving) that rush towards pleasurable thoughts are strong, such a deluded person, torrential thoughts of lust carry off.",
    "340": "The streams (craving) flow everywhere. The creeper (craving) sprouts and stands. Seeing the creeper that has sprung up, with wisdom cut off root.",
    "341": "In beings there arise pleasures that rush (towards sense-objects) and (such beings) are steeped in craving. Bent on happiness, they seek happiness. Verily, such men come to birth and decay.",
    "342": "Folk enwrapt in craving are terrified like a captive hare. Held fast by fetters and bonds, for long they come to sorrow again and again.",
    "343": "Folk, enwrapt in craving, are terrified like a captive hare. Therefore a bhikkhu who wishes his own passionlessness (Nibbàna) should discard craving.",
    "344": "Whoever with no desire (for the household) finds pleasure in the forest (of asceticism) and though freed from desire (for the household), (yet) runs back to that very home. Come, behold that man! Freed, he runs back into that very bondage.",
    "345": "That which is made of iron, wood or hemp, is not a strong bond, say the wise; the longing for jewels, ornaments, children, and wives is a far greater attachment.",
    "346": "That bond is strong, say the wise. It hurls down, is supple, and is hard to loosen. This too the wise cut off, and leave the world, with no longing, renouncing sensual pleasures.",
    "347": "Those who are infatuated with lust fall back into the stream as (does) a spider into the web spun by itself. This too the wise cut off and wander, with no longing, released from all sorrow.",
    "348": "Let go the past. Let go the future. Let go the present (front, back and middle). Crossing to the farther shore of existence, with mind released from everything, do not again undergo birth and decay.",
    "349": "For the person who is perturbed by (evil) thoughts, who is exceedingly lustful, who contemplates pleasant things, craving increases more and more. Surely, he makes the bond (of Màra) stronger.",
    "350": "He who delights in subduing (evil) thoughts, who meditates on \"the loathesomeness\" (of the body) who is ever mindful - it is he who will make an end (of craving). He will sever Màras bond.",
    "351": "He who has reached the goal, is fearless, is without craving, is passionless, has cut off the thorns of life. This is his final body.",
    "352": "He who is without craving and grasping, who is skilled in etymology and terms, who knows the grouping of letters and their sequence - it is he who is called the bearer of the final body, one of profound wisdom, a great man.",
    "353": "All have I overcome, all do I know. From all am I detached. All have I renounced. Wholly absorbed am I in \"the destruction of craving\". Having comprehended all by myself, whom shall I call my teacher.",
    "354": "The gift of Truth excels all (other) gifts. The flavour of Truth excels all (other) flavours. The pleasure in Truth excels all (other) pleasures. He who has destroyed craving overcomes all sorrow.",
    "355": "Riches ruin the foolish, but not those in quest of the Beyond (Nibbàna). Through craving for riches the ignorant man ruins himself as (if he were ruining) others.",
    "356": "Weeds are the bane of fields, lust is the bane of mankind. Hence what is given to those lustless yields abundant fruit.",
    "357": "Weeds are the bane of fields, hatred is the bane of mankind. Hence what is given to those rid of hatred yields abundant fruit.",
    "358": "Weeds are the bane of fields, delusion is the bane of mankind. Hence what is given to those rid of delusion yields abundant fruit.",
    "359": "Weeds are the bane of fields, craving is the bane of mankind. Hence what is given to those rid of craving yields abundant fruit.",
    "360": "Good is restraint in the eye; good is restraint in the ear; good is restraint in the nose; good is restraint in the tongue.",
    "361": "Good is restraint in deed; good is restraint in speech; good is restraint in mind; good is restraint in everything. The bhikkhu, restrained at all points, is freed from sorrow.",
    "362": "He who is controlled in hand, in foot, in speech, and in the highest (i.e., the head); he who delights in meditation, and is composed; he who is alone, and is contented - him they call a bhikkhu.",
    "363": "The bhikkhu who is controlled in tongue, who speaks wisely, who is not puffed up, who explains the meaning and the text - sweet, indeed, is his speech.",
    "364": "That bhikkhu who dwells in the Dhamma, who delights in the Dhamma, who meditates on the Dhamma, who well remembers the Dhamma, does not fall away from the sublime Dhamma.",
    "365": "Let him not despise what he has received, nor should he live envying (the gains of) others. The bhikkhu who envies (the gains of) others does not attain concentration.",
    "366": "Though receiving but little, if a bhikkhu does not despise his own gains, even the gods praise such a one who is pure in livelihood and is not slothful.",
    "367": "He who has no thought of \"l\" and \"mine\" whatever towards mind and body, he who grieves not for that which he has not, he is, indeed, called a bhikkhu.",
    "368": "The bhikkhu who abides in loving-kindness, who is pleased with the Buddhas Teaching, attains to that state of peace and happiness, the stilling of conditioned things.",
    "369": "Empty this boat, O bhikkhu! Emptied by you it will move swiftly. Cutting off lust and hatred, to Nibbàna you will thereby go.",
    "370": "Five cut off, five give up, five further cultivate. The bhikkhu who has gone beyond the five bonds is called a \"Flood-Crosser\".",
    "371": "Meditate, O bhikkhu! Be not heedless. Do not let your mind whirl on sensual pleasures. Do not be careless and swallow a ball of lead. As you burn cry not \"This is sorrow\".",
    "372": "There is no concentration in one who lacks wisdom, nor is there wisdom in him who lacks concentration. In whom are both concentration and wisdom, he, indeed, is in the presence of Nibbàna.",
    "373": "The bhikkhu who has retired to a lonely abode, who has calmed his mind, who perceives the doctrine clearly, experiences a joy transcending that of men.",
    "374": "Whenever he reflects on the rise and fall of the Aggregates, he experiences joy and happiness. To \"those who know\" that (reflection) is Deathless.",
    "375": "And this becomes the beginning here for a wise bhikkhu: sense-control, contentment, restraint with regard to the Fundamental Code (Pàtimokkha), association with beneficent and energetic friends whose livelihood is pure.",
    "376": "Let him be cordial in his ways and refined in conduct; filled thereby with joy, he will make an end of ill.",
    "377": "As the jasmine creeper sheds its withered flowers, even so, O bhikkhus, should you totally cast off lust and hatred.",
    "378": "The bhikkhu who is calm in body, calm in speech, calm in mind, who is well-composed, who has spewed out worldly things, is truly called a \"peaceful one\".",
    "379": "By self do you censure yourself. By self do you examine yourself. Self-guarded and mindful, O bhikkhu, you will live happily.",
    "380": "Self, indeed, is the protector of self. Self, indeed, is ones refuge. Control, therefore, your own self as a merchant controls a noble steed.",
    "381": "Full of joy, full of confidence in the Buddhas Teaching, the bhikkhu will attain the Peaceful State, the stilling of conditioned things, the bliss (supreme).",
    "382": "The bhikkhu who, while still young, devotes himself to the Buddhas Teaching, illumines this world like the moon freed from a cloud.",
    "383": "Strive and cleave the stream. Discard, O bràhmaua, sense-desires. Knowing the destruction of conditioned things, be, O bràhmaua, a knower of the Unmade (Nibbàna).",
    "384": "When in two states a bràhmaua goes to the Farther Shore, then all the fetters of that \"one who knows\" pass away.",
    "385": "For whom there exists neither the hither nor the farther shore, nor both the hither and the farther shore, he who is undistressed and unbound, - him I call a bràhmaua.",
    "386": "He who is meditative, stainless and secluded, he who has done his duty and is free from corruptions, he who has attained the Highest Goal - him I call a bràhmaua.",
    "387": "The sun shines by day; the moon is radiant by night. Armoured shines the warrior king. Meditating the bràhmaua shines. But all day and night the Buddha shines in glory.",
    "388": "Because he has discarded evil, he is called a bràhmaua; because he lives in peace, he is called a samana; because he gives up the impurities, he is called a pabbajita - recluse.",
    "389": "One should not strike a bràhmaua, nor should a bràhmaua vent (his wrath) on one who has struck him. Shame on him who strikes a bràhmaua! More shame on him who gives vent (to his wrath).",
    "390": "Unto a bràhmaua that (non-retaliation) is of no small advantage. When the mind is weaned from things dear, whenever the intent to harm ceases, then and then only doth sorrow subside.",
    "391": "He that does no evil through body, speech or mind, who is restrained in these three respects - him I call a bràhmaua.",
    "392": "If from anybody one should understand the doctrine preached by the Fully Enlightened One, devoutly should one reverence him, as a brahmin reveres the sacrificial fire.",
    "393": "Not by matted hair, nor by family, nor by birth does one become a bràhmaua. But in whom there exist both truth and righteousness, pure is he, a bràhmaua is he.",
    "394": "What is the use of your matted hair, O witless man? What is the use of your antelope skin garment? Within, you are full of passions; without, you embellish yourself.",
    "395": "The person who wears dust-heap robes, who is lean, whose veins stand out, who meditates alone in the forest - him I call a bràhmaua.",
    "396": "I do not call him a bràhmaua merely because he is born of a (brahmin) womb or sprung from a (brahmin) mother. He is merely a \"Dear-addresser\", if he be with impediments. He who is free from impediments, free from clinging - him I call a bràhmaua.",
    "397": "He who has cut off all fetters, who trembles not, who has gone beyond ties, who is unbound - him I call a bràhmaua.",
    "398": "He who has cut the strap (hatred), the thong (craving), and the rope (heresies), together with the appendages (latent tendencies), who has thrown up the cross-bar (ignorance), who is enlightened (Buddha) - him I call a bràhmaua.",
    "399": "He who, without anger, endures reproach, flogging and punishments, whose power and potent army is patience - him I call a bràhmaua.",
    "400": "He who is not wrathful, but is dutiful, virtuous, free from craving, self-controlled and bears his final body, - him I call a bràhmaua.",
    "401": "Like water on a lotus leaf, like a mustard seed on the point of a needle, he who clings not to sensual pleasures - him I call a bràhmaua.",
    "402": "He who realizes here in this world the destruction of his sorrow, who has laid the burden aside and is emancipated, - him I call a bràhmaua.",
    "403": "He whose knowledge is deep, who is wise, who is skilled in the right and wrong way, who has reached the highest goal - him I call a bràhmaua.",
    "404": "He who is not intimate either with householders or with the homeless ones, who wanders without an abode, who is without desires - him I call a bràhmaua.",
    "405": "He who has laid aside the cudgel in his dealings with beings, whether feeble or strong, who neither harms nor kills - him I call a bràhmaua.",
    "406": "He who is friendly amongst the hostile, who is peaceful amongst the violent, who is unattached amongst the attached, - him I call a bràhmaua.",
    "407": "In whom lust, hatred, pride, detraction are fallen off like a mustard seed from the point of a needle - him I call a bràhmaua.",
    "408": "He who utters gentle, instructive, true words, who by his speech gives offence to none - him I call a bràhmaua.",
    "409": "He who in this world takes nothing that is not given, be it long or short, small or great, fair or foul - him I call a bràhmaua.",
    "410": "He who has no longings, pertaining to this world or to the next, who is desireless and emancipated - him I call a bràhmaua.",
    "411": "He who has no longings, who, through knowledge, is free from doubts, who has gained a firm footing in the Deathless (Nibbàna) - him I call a bràhmaua.",
    "412": "Herein he who has transcended both good and bad and the ties as well, who is sorrowless, stainless, and pure - him I call a bràhmaua.",
    "413": "He who is spotless as the moon, who is pure, serene, and unperturbed, who has destroyed craving for becoming - him I call a bràhmaua.",
    "414": "He who has passed beyond this quagmire, this difficult path, the ocean of life (samsàra), and delusion, who has crossed and gone beyond, who is meditative, free from craving and doubts, who, clinging to naught, has attained Nibbàna - him I call a bràhmaua.",
    "415": "He who in this world giving up sense-desires, would renounce worldly life and become a homeless one, he who has destroyed sense-desires and becoming - him I call a bràhmaua.",
    "416": "He who in this world giving up craving, would renounce worldly life and become a homeless one, he who has destroyed craving and becoming - him I call a bràhmaua.",
    "417": "He who, discarding human ties and transcending celestial ties, is completely delivered from all ties - him I call a bràhmaua.",
    "418": "He who has given up likes and dislikes, who is cooled and is without defilements, who has conquered the world and is strenuous - him I call a bràhmaua.",
    "419": "He who in every way knows the death and rebirth of beings, who is non-attached, well-gone, and enlightened, - him I call a bràhmaua.",
    "420": "He whose destiny neither gods nor gandhabbas nor men know, who has destroyed all corruptions, and is far removed from passions (Arahant) - him I call a bràhmaua.",
    "421": "He who has no clinging to Aggregates that are past, future, or present, who is without clinging and grasping - him I call a bràhmaua.",
    "422": "The fearless, the noble, the hero, the great sage, the conqueror, the desireless, the cleanser (of defilements), the enlightened, - him I call a bràhmaua.",
    "423": "That sage who knows his former abodes, who sees the blissful and the woeful states, who has reached the end of births, who, with superior wisdom, has perfected himself, who has completed (the holy life), and reached the end of all passions - him I call a bràhmaua."
}