{
    "1": "All mental phenomena have mind as their forerunner; they have mind as their chief; they are mind-made. If one speaks or acts with an evil mind, dukkha follows him just as the wheel follows the hoofprint of the ox that draws the cart.",
    "2": "All mental phenomena have mind as their forerunner; they have mind as their chief; they are mind-made. If one speaks or acts with a pure mind, happiness (sukha) follows him like a shadow that never leaves him.",
    "3": "\"He abused me, he ill-treated me, he got the better of me, he stole my belongings;\"... the enmity of those harbouring such thoughts cannot be appeased.",
    "4": "\"He abused me, he ill-treated me, he got the better of me, he stole my belongings;\" ... the enmity of those not harbouring such thoughts can be appeased.",
    "5": "Hatred is, indeed, never appeased by hatred in this world. It is appeased only by loving-kindness. This is an ancient law.",
    "6": "People, other than the wise, do not realize, \"We in this world must all die,\" (and not realizing it continue their quarrels). The wise realize it and thereby their quarrels cease.",
    "7": "He who keeps his mind on pleasant objects, who is uncontrolled in his senses, immoderate in his food, and is lazy and lacking in energy, will certainly be overwhelmed by Mara, just as stormy winds uproot a weak tree.",
    "8": "He who keeps his mind on the impurities (of the body), who is well-controlled in his senses and is full of faith and energy, will certainly be not overwhelmed by Mara, just as stormy winds cannot shake a mountain of rock.",
    "9": "He who is not free from taints of moral defilements (kilesas) and yet dons the yellow robe, who lacks restraint in his senses and (speaks not the) truth is unworthy of the yellow robe.",
    "10": "He who has discarded all mural defilements (kilesas), who is established in moral precepts, is endowed with restraint and (speaks the) truth is, indeed, worthy of the yellow robe.",
    "11": "They take untruth for truth; they take truth for untruth; such persons can never arrive at the truth, for they hold wrong views.",
    "12": "They take truth for truth; they take untruth for untruth; such persons arrive at the truth, for they hold right views. At the end of the discourse, many people came to be established in Sotapatti Fruition.",
    "13": "Just as rain penetrates a badly-roofed house, so also, passion (raga) penetrates a mind not cultivated in Tranquillity and Insight Development (Samatha and Vipassana).",
    "14": "Just as rain cannot penetrate a well-roofed house, so also, passion (raga) cannot penetrate a mind well-cultivated in Tranquillity and Insight Development (Samatha and Vipassana).",
    "15": "Here he grieves, hereafter he grieves; the evil-doer grieves in both existences. He grieves and he suffers anguish when he sees the depravity of his own deeds.",
    "16": "Here he rejoices, hereafter he rejoices; one who performed meritorious deeds rejoices in both existences. He rejoices and greatly rejoices when he sees the purity of his own deeds.",
    "17": "Here he is tormented, hereafter he is tormented; the evil-doer is tormented in both existences. He is tormented, and he laments: \"Evil have I done.\" He is even more tormented when he is reborn in one of the lower worlds (Apaya).",
    "18": "Here he is happy, hereafter he is happy; one who performs meritorious deeds is happy in both existences. Happily he exclaims: I have done meritorious deeds.\" He is happier still when he is reborn in a higher world (suggati).",
    "19": "Though he recites much the Sacred Texts (Tipitaka), but is negligent and does not practise according to the Dhamma, like a cowherd who counts the cattle of others, he has no share in the benefits of the life of a bhikkhu (i.e., Magga-phala).",
    "20": "Though he recites only a little of the Sacred Texts (Tipitaka), but practises according to the Dhamma, eradicating passion, ill will and ignorance, clearly comprehending the Dhamma, with his mind freed from moral defilements and no longer clinging to this world or to the next, he shares the benefits of the life of a bhikkhu (i.e.,Magga-phala).",
    "21": "Mindfulness is the way to the Deathless (Nibbana); unmindfulness is the way to Death. Those who are mindful do not die; those who are not mindful are as if already dead.",
    "22": "Fully comprehending this, the wise, who are mindful, rejoice in being mindful and find delight in the domain of the Noble Ones (Ariyas).",
    "23": "The wise, constantly cultivating Tranquillity and Insight Development Practice, being ever mindful and steadfastly striving, realize Nibbana: Nibbana, which is free from the bonds of yoga*; Nibbana, the Incomparable!",
    "24": "If a person is energetic, mindful, pure in his thought, word and deed, and if he does every thing with care and consideration, restrains his senses, earns his living according to the Law (Dhamma) and is not unheedful, then, the fame and fortune of that mindful person steadily increase.",
    "25": "Through diligence, mindfulness, discipline (wtth regard to moral precepts), and control of his senses, let the man of wisdom make of himself an island which no flood can overwhelm.",
    "26": "The foolish and the ignorant give themselves over to negligence; whereas the wise treasure mindfulness as a precious jewel.",
    "27": "Therefore, one should not be negligent, nor be addicted to sensual pleasures; for he who is established in mindfulness, through cultivation of Tranquillity and Insight Development Practice, experiences supreme happiness (i.e., realizes Nibbana).",
    "28": "The wise one dispels negligence by means of mindfulness; he ascends the pinnacle of wisdom and being free from sorrow looks at the sorrowing beings. Just as one on the mountain top looks at those on the plain below, so also, the wise one (the arahat) looks at the foolish and the ignorant (worldlings).",
    "29": "Mindful amongst the negligent, highly vigilant amongst the drowsy, the man of wisdom advances like a race-horse, leaving the jade behind.",
    "30": "Through mindfulness (in doing meritorious deeds) Magha became king of the devas. Mindfulness is always praised, but negligence is always blamed.",
    "31": "A bhikkhu who takes delight in mindfulness and sees danger in negligence, advances like fire, burning up all fetters, great and small.",
    "32": "A bhikkhu who takes delight in mindfulness and sees danger in negligence will not fall away*; he is, indeed, very close to Nibbana.",
    "33": "The mind is excitable and unsteady; it is difficult to control and to restrain. The wise one trains his mind to be upright as a fletcher straightens an arrow.",
    "34": "As a fish quivers when taken out of its watery home and thrown on to dry ground, so does the mind quiver when it is taken out of the sensual world to escape from the realm of Mara (i.e., kilesa vatta, round of moral defilements).",
    "35": "The mind is difficult to control; swiftly and lightly, it moves and lands wherever it pleases. It is good to tame the mind, for a well-tamed mind brings happiness.",
    "36": "The mind is very difficult to see, very delicate and subtle; it moves and lands wherever it pleases. The wise one should guard his mind, for a guarded mind brings happiness.",
    "37": "The mind wanders far and moves about alone: it is non-material; it lies in the cave (chamber) of the heart. Those who control their mind will be free from the bonds of Mara",
    "38": "If a mans mind is unsteady, if he is ignorant of the true Dhamma, and if his faith is wavering, then his knowledge will never be perfect.",
    "39": "If a manes mind is free from passion, if he is free from ill will, if he has abandoned both good and evil, and if he is vigilant, for such a man there is no danger.",
    "40": "Knowing that this body is (fragile) like an earthern jar, making ones mind secure like a fortified town, one should fight Mara with the weapon of Knowledge. (After defeating Mara) one should still continue to guard ones mind, and feel no attachment to that which has been gained (i.e., jhana ecstasy and serenity gained through meditation).",
    "41": "Before long, alas, this body, deprived of consciousness, will lie on the earth, discarded like a useless log!",
    "42": "A thief may harm a thief; an enemy may harm an enemy; but a wrongly directed mind can do oneself far greater harm.",
    "43": "Not a mother, nor a father, nor any other relative can do more for the well-being of one than a rightly-directed mind can.",
    "44": "Who shall examine this earth (i. e., this body) the world of Yama (i. e., the four Apayas) and the world of man together with the world of devas? Who shall examine the well-taught Path of Virtue (Dhammapada) as an expert florist picks and chooses flowers?",
    "45": "The Ariya Sekha* shall examine this earth (i. e., the body), the world of Yama (i. e., the four Apayas) and the world of man together with the world of devas. The Ariya Sekha shall examine the well-taught Path of Virtue (Dhammapada) as an expert florist picks and chooses flowers.",
    "46": "One who knows that this body is impermanent like froth, and comprehends that it is insubstantial like a mirage will cut the flowers of Mara (i.e., the three kinds of vatta or rounds), and pass out of sight of the King of Death.",
    "47": "Like one who picks and chooses flowers, a man who has his mind attached to sensual pleasures is carried away by Death, just as a great flood sweeps away a sleeping village.",
    "48": "Like one who picks and chooses flowers, a man who has his mind attached to sensual pleasures and is insatiate in them is over powered by Death.",
    "49": "As the bee collects nectar and flies away without damaging the flower or its colour or its scent, so also, let the bhikkhu dwell and act in the village (without affecting the faith and generosity or the wealth of the villagers).",
    "50": "One should not consider the faults of others, nor their doing or not doing good or bad deed;. One should consider only whether one has done or not done good or bad deeds.",
    "51": "Just as a beautiful flower, lacking in scent, cannot give the wearer the benefit of its scent, so also, the well-preached words of the Buddha cannot benefit one who does not practise the Dhamma.",
    "52": "Just as a flower, beautiful as well as fragrant, will give the wearer the benefit of its scent, so also, the well-preached words of the Buddha will benefit one who practises the Dhamma.",
    "53": "As from a collection of flowers many a garland can be made by an expert florist, so also, much good can be done (with wealth, out of faith and generosity) by one subject to birth and death.",
    "54": "The scent of flowers cannot go against the wind; nor the scent of sandalwood, nor of rhododendron, nor of jasmin (mallika); only the reputation of good people can go against the wind. The reputation of the virtuous ones (sappurisa) is wafted abroad in all directions.",
    "55": "There are the scents of sandalwood, rhododendron, lotus and jasmin (vassika); but the scent of virtue surpasses all scents.",
    "56": "The scents of rhododendron and of sandal wood are very faint; but the scent (reputation) of the virtuous is the strongest; it spreads even to the abodes of the deva.",
    "57": "Mara cannot find the path taken by those who are endowed with virtue, who live mindfully and have been freed from moral defilements by Right Knowledge.",
    "58": "As a sweet-smelling and beautiful lotus flower may grow upon a heap of rubbish thrown on the highway,",
    "59": "so also, out of the rubbish heap of beings may appear a disciple of the Buddha, who with his wisdom shines forth far above the blind (ignorant) worldlings.",
    "60": "Long is the night to one who is wakeful; long is (the journey of) one yojana to the traveller who is tired; long is samsara (round of rebirths) to the fool, who is ignorant of the true Dhamma (the Teaching of the Buddha).",
    "61": "If a person seeking a companion cannot find one who is better than or equal to him, let him resolutely go on alone; there can be no companionship with a fool.",
    "62": "\"I have sons, I have wealth\"; with this (feeling of attachment) the fool is afflicted. Indeed, he himself is not his own, how can sons and wealth be his?",
    "63": "The fool who knows that he is a fool can, for that reason, be a wise man; but the fool who thinks that he is wise is, indeed, called a fool.",
    "64": "A fool, even though he is associated with a wise man all his life, does not understand the Dhamma, just as a ladle does not know the taste of soup.",
    "65": "An intelligent man, even though he is associated with a wise man only for a moment, quickly understands the Dhamma, just as the tongue knows the taste of soup.",
    "66": "66. With themselves as their own enemies, fools lacking in intelligence, move about doing evil deeds, which bear bitter fruits.",
    "67": "That deed is not well done, if one has to repent for having done it, and if, with a tearful face, one has to weep as a result of that deed.",
    "68": "That deed is well done if one has not to repent for having done it, and if one is delightful and happy with the result of that deed.",
    "69": "As long as the evil deed does not bear fruit, the fool thinks it is sweet like honey; but when his evil deed does bear fruit, the fool suffers for it.",
    "70": "Even though, month after month, the fool (living in austerity) takes his food sparingly with the tip of a grass blade, he is not worth even one-sixteenth part of those who have comprehended the Truth (i.e., the ariyas).",
    "71": "An evil deed does not immediately bear fruit, just as the newly-drawn milk does not curdle at once; but it follows the fool burning him like live coal covered with ashes.",
    "72": "The skill of a fool can only harm him; it destroys his merit and his wisdom (lit., it severs his head).",
    "73": "The foolish bhikkhu desires praise for qualities he does not have, precedence among bhikkhus, authority in the monasteries, and veneration from those unrelated to him.",
    "74": "\"Let both laymen and bhikkhus think that things are done because of me; let them obey me in all matters, great and small.\" Such being the thoughts of the fool, his greed and his pride grow.",
    "75": "Indeed, the path that leads to worldly gain is one and the Path that leads to Nibbana is another. Fully comprehending this, the bhikkhu, the disciple of the Buddha, should not take delight in worldly gain and honour, but devote himself to solitude, detachment and the realization of Nibbana.",
    "76": "One should follow a man of wisdom who rebukes one for ones faults, as one would follow a guide to some buried treasure. To one who follows such a wise man, it will be an advantage and not a disadvantage.",
    "77": "The man of wisdom should admonish others; he should give advice and should prevent others from doing wrong; such a man is held dear by the good; be is disliked only by the bad.",
    "78": "One should not associate with bad friends, nor with the vile. One should associate with good friends, and with those who are noble.",
    "79": "He who drinks in the Dhamma lives happily with a serene mind; the wise man always takes delight in the Dhamma (Bodhipakkhiya Dhamma) expounded by the Noble Ones (ariyas).",
    "80": "Farmers (lit., makers of irrigation canals ) channel the water; fletchers straighten the arrow; carpenters work the timber; the Wise tame themselves.",
    "81": "As a mountain of rock is unshaken by wind, so also, the wise are unperturbed by blame or by praise.",
    "82": "Like a lake which is deep, clear and calm, the wise after listening to the Teaching (Dhamma) become serene.",
    "83": "Indeed, the virtuous give up all (i.e., attachment to the five khandhas, etc.); the virtuous (lit., the tranquil) do not talk with sensual desire; when faced with joy or sorrow, the wise do not show elation or depression.",
    "84": "For his own sake or for the sake of others, he does no evil; nor does he wish for sons and daughters or for wealth or for a kingdom by doing evil; nor does he wish for success by unfair means; such a one is indeed virtuous, wise and just.",
    "85": "Few among men reach the other shore (Nibbana); all the others only run up and down on this shore.",
    "86": "But those who practise according to the well-expounded Dhamma will reach the other shore (Nibbana), having passed the realm of Death (i.e., samsara), very difficult as it is to cross. ",
    "87": "The man of wisdom, leaving the home of craving and having Nibbana as his goal, should give up dark, evil ways and cultivate pure, good ones.",
    "88": "He should seek great delight in solitude, detachment and Nibbana, which an ordinary man finds so difficult to enjoy. He should also give up sensual pleasures, and clinging to nothing, should cleanse himself of all impurities of the mind.",
    "89": "Those, with mind well-developed in the seven Factors of Enlightenment (bojjhanga), having rid themselves of all craving, rejoice in their abandonment of attachment. Such men, with all moral intoxicants eradicated, and powerful (with the light of Arahatta Magganana), have realized Nibbana in this world (i.e., with Khandha aggregates remaining).",
    "90": "For him (an arahat) whose journey is ended, who is free from sorrow and from all (e.g. khandha aggregates), who has destroyed all fetters, there is no more distress.",
    "91": "The mindful strive diligently (in the Tranquillity and Insight Development Practice); they take no delight in the home (i.e., in the life of sensual pleasures); like swans (hamsa) that forsake the muddy pool, they abandon all home life (i.e., all cravings).",
    "92": "Arahats do not hoard (anything); when taking food they reflect well over it (i.e., in accordance with the three parinnas).* They have as their object liberation from existence, that is, Nibbana which is Void and Signless. Their destination, like the course of birds in the air, cannot be traced.",
    "93": "The arahat is free from moral intoxicants (asavas); he is not attached to food. He has as his object liberation from existence, i.e., Nibbana which is Void and Signless. His path, like that of birds in the air, cannot be traced.",
    "94": "The arahat whose sense-faculties are calm like horses well-tamed by the charioteer, who is free from pride and moral intoxicants - such an arahat is held dear even by the devas.",
    "95": "Like the earth, the arahat is patient and is not provoked to respond in anger; like the door-post he is firm; he is unperturbed by the ups and downs of life; he is serene and pure like a lake free from mud. For such an arahat there will be no more rebirth.",
    "96": "An arahat is calm in his mind, calm in his speech, and also in his deed; truly knowing the Dhamma, such an arahat is free from moral defilements and is unpurturbed by the ups and downs of life.",
    "97": "He who is not credulous, who has realized the Unconditioned (Nibbana), who has cut off the links of the round of rebirths, who has destroyed all consequences of good and bad deeds, who has discarded all craving, is indeed the noblest of all men (i.e., an arahat).",
    "98": "In a village or in a forest, in a valley or on a hill, wherever arahats dwell, that place is delightful.",
    "99": "Forests are delightful, but the worldlings find no delight in them; only those who are free from passion will find delight in them, for they do not seek sensual pleasures.",
    "100": "Better than a thousand words that are senseless and unconnected with the realization of Nibbana, is a single word of sense, if on hearing it one is calmed.",
    "101": "Better than a thousand verses that are senseless and unconnected with the realization of Nibbana, is a single verse, if on hearing it one is calmed.",
    "102": "Better than the recitation of a hundred verses that arc senseless and unconnected with the realization of Nibbana, is the recitation of a single verse of the Teaching (Dhamma), if on hearing it one is calmed.",
    "103": "A man may conquer a million men in battle, but one who conquers himself is, indeed, the greatest of conquerors.",
    "104": "It is better indeed, to conquer oneself than to conquer others.",
    "105": "Neither a deva, nor a gandhabba, nor Mara together with Brahma can turn into defeat the victory of the man who controls himself.",
    "106": "Month after month for a hundred years, one may make offerings (to ordinary people) to the value of a thousand Kahapanas; yet if, only for a moment one pays homage to a bhikkhu who has practised Insight Development, this homage is, indeed, better than a hundred years of making offerings (to ordinary people).",
    "107": "For a hundred years, a man may tend the sacred fire in the forest: yet if, only for a moment, one pays homage to a bhikkhu who has practised Insight Development, this homage is, indeed, better than a hundred years of making sacrifices (in fire-worship).",
    "108": "In this world, one may make sacrificial offerings, great and small, all the year round, in order to gain merit; all these offerings are not worth a quarter of the merit gained by worshipping the Noble Ones (Ariyas) who walk the right path. At the end of the discourse the brahmin attained Sotapatti Fruition.",
    "109": "For one who always respects and honours those who are older and more virtuous, four benefits, viz., longevity, beauty, happiness and strength, will increase.",
    "110": "Better than a hundred years in the life of an immoral person who has no control over his senses, is a day in the life of a virtuous person who cultivates Tranquillity and Insight Development Practice.",
    "111": "Better than a hundred years in the life of an ignorant person, who has no control over his senses, is a day in the life of a wise man who cultivates Tranquillity and Insight Development Practice.",
    "112": "Better than a hundred years in the life of a person who is idle and inactive, is a day in the life of one who makes a zealous and strenuous effort (in Tranquillity and Insight Development Practice).",
    "113": "Better than a hundred years in the life of a person who does not perceive the arising and the dissolving of the five aggregates (khandhas), is a day in the life of one who perceives the arising and dissolving of the five aggregates.",
    "114": "Better than a hundred years in the life of a person who does not perceive the Deathless (Nibbana), is a day in the life of one who perceives the Deathless (Nibbana).",
    "115": "Better than a hundred years in the life of a person who does not comprehend the Noble Dhamma (Dhammamuttamam), is a day in the life of one who comprehends the Noble Dhamma. End of Chapter Eight: The Thousand.",
    "116": "One should make haste in doing good deeds; one should restrain ones mind from evil; for the mind of one who is slow in doing good tends to take delight in doing evil.",
    "117": "If a man does evil, he should not do it again and again; he should not take delight in it; the accumulation of evil leads to dukkha.",
    "118": "If a man does what is good, he should do it again and again; he should take delight in it; the accumulation of merit leads to happiness.",
    "119": "Even an evil person may still find happiness so long as his evil deed does not bear fruit; but when his evil deed does bear fruit he will meet with evil consequences.",
    "120": "Even a good person may still meet with suffering so long as his good deed does not bear fruit: but when it does bear fruit he will enjoy the benefits of his good deed.",
    "121": "One should not think lightly of doing evil, imagining \"A little will not affect me\"; just as a water-jar is filled up by falling drops of rain, so also, the fool is filled up with evil, by accumulating it little by little.",
    "122": "One should not think lightly of doing good, imagining \"A little will not affect me; just as a water-jar is filled up by falling drops of rain, so also, the wise one is filled up with merit, by accumulating it little by little.",
    "123": "Just as a wealthy merchant with few attendants avoids a dangerous road, just as one who desires to go on living avoids poison, so also, one should avoid evil.",
    "124": "If there is no wound on the hand, one may handle poison; poison does not affect one who has no wound; there can be no evil for one who has no evil intention.",
    "125": "If one wrongs a person who should not be wronged, one who is pure and is free from moral defilements, viz., an arahat, the evil falls back upon that fool, like fine dust thrown against the wind.",
    "126": "Some are reborn as human beings, the wicked are reborn in a place of continuous torment (niraya). the righteous go to the deva world, and those who are free from moral intoxicants (viz., the arahats) realize Nibbana.",
    "127": "Not in the sky, nor in the middle of the ocean, nor in the cave of a mountain, nor anywhere else, is there a place, where one may escape from the consequences of an evil deed.",
    "128": "Not in the sky, nor in the middle of the ocean, nor in the cave of a mountain, nor anywhere else, is there a place where one cannot be oppressed by Death.",
    "129": "All are afraid of the stick, all fear death. Putting oneself in anothers place, one should not beat or kill others.",
    "130": "All are afraid of the stick, all hold their lives dear. Putting oneself in anothers place, one should not beat or kill others.",
    "131": "He who seeks his own happiness by oppressing others, who also desire to have happiness, will not find happiness in his next existence.",
    "132": "He who seeks his own happiness by not oppressing others, who also desire to have happiness, will find happiness in his next existence.",
    "133": "Do not speak harshly to anyone; those who are thus spoken to will retort. Malicious talk is indeed the cause of trouble (dukkha) and retribution will come to you.",
    "134": "If you can keep yourself calm and quiet like a broken gong which is no longer resonant, you are sure to realize Nibbana, there will be no harshness in you.",
    "135": "As with a stick the cowherd drives his cattle to the pasture, so also, Ageing and Death drive the life of beings.",
    "136": "A fool while doing evil deeds does not know them as being evil; but that fool suffers for his evil deeds like one who is burnt by fire.",
    "137": "He who does harm with weapons to those who are harmless and should not be harmed will soon come to any of these ten evil consequences:",
    "138": "He will be subject to severe pain, or impoverishment, or injury to the body (i.e., loss of limbs), or serious illness (e.g., leprosy), or lunacy,",
    "139": "or misfortunes following the wrath of the king, or wrongful and serious accusations, or loss of relatives, or destruction of wealth,",
    "140": "or the burning down of his houses by fire or by lightning. After the dissolution of his body, the fool will be reborn in the plane of continuous suffering (niraya).",
    "141": "Not going naked, nor having matted hair, nor smearing oneself with mud, nor fasting, nor sleeping on bare ground, nor covering oneself with dust, nor striving by squatting can purify a being, who has not yet overcome doubt.",
    "142": "Though he is gaily decked, if he is calm, free from moral defilements, and has his senses controlled, if he is established in Magga Insight, if he is pure and has laid aside enmity (lit., weapons) towards all beings, he indeed is a brahmana, a samana, and a bhikkhu.",
    "143": "Rare in this world is the kind of person whoout of a sense of shame restrains from doing evil and keeps himself awake like a good horse that gives no cause to be whipped.",
    "144": "Like a good horse stirred at a touch of the whip, be diligent and get alarmed by endless round of rebirths (i. e., samsara). By faith, morality, effort, concentration, discernment of the Dhamma, be endowed with knowledge and practice of morality, and with mindfulness, leave this immeasurable dukkha (of samsara) behind.",
    "145": "Farmers** channel the water; fletchers straighten the arrows; carpenters work the timber; the wise tame themselves.",
    "146": "Why is there laughter? Why is there joy although (the world) is always burning? Shrouded in darkness why not seek the light?",
    "147": "Look at this dressed up body, a mass of sores, supported (by bones), sickly, a subject of many thoughts (of sensual desire). Indeed, that body is neither permanent nor enduring.",
    "148": "This body is worn out-with age, it is the seat of sickness, it is subject to decay. This putrid body disintegrates; life, indeed, ends in death.",
    "149": "Like gourds thrown away in autumn are these dove-grey bones; what pleasure is there in seeing them?",
    "150": "This body (lit., the city) is built up with bones which are covered with flesh and blood; within this dwell (lit., are deposited) decay and death, pride and detraction (of others virtues and reputation).",
    "151": "The much ornamented royal carriages do wear out, the body also grows old, but the Dhamma of the Virtuous does not decay. Thus, indeed, say the Virtuous among themselves.",
    "152": "This man of little learning grows old like an ox; only his flesh grows but not his wisdom.",
    "153": "I, who have been seeking the builder of this house (body), failing to attain Enlightenment (Bodhi nana or Sabbannuta nana) which would enable me to find him, have wandered through innumerable births in samsara. To be born again and again is, indeed, dukkha!",
    "154": "Oh house-builder! You are seen, you shall build no house (for me) again. All your rafters are broken, your roof-tree is destroyed. My mind has reached the Unconditioned (i.e., Nibbana); the end of craving (Arahatta Phala) has been attained.",
    "155": "They, who in youth have neither led the Life of Purity nor have acquired wealth, waste away in dejection like decrepit herons on a drying pond deplete of fish.",
    "156": "They, who in youth have neither led the Life of Purity nor have acquired wealth, lie helplessly like arrows that have lost momentum, moaning and sighing after the past.",
    "157": "If one knows that one is dear to oneself, one should protect oneself well. During any of the three watches (of life) the wise man should be on guard (against evil).",
    "158": "One should first establish oneself in what is proper; then only one should teach others. A wise man should not incur reproach.",
    "159": "One should act as one teaches others; only with oneself thoroughly tamed should one tame others. To tame oneself is, indeed, difficult.",
    "160": "One indeed is ones own refuge; how can others be a refuge to one? With oneself thoroughly tamed, one can attain a refuge (i.e., Arahatta Phala), which is so difficult to attain.",
    "161": "The evil done by oneself, arising in oneself, and caused by oneself, destroys the foolish one, just as a diamond grinds the rock from which it is formed.",
    "162": "As the creeper (maluva) strangle the sal tree, so also, a really immoral person (overwhelmed by Craving) does to himself just what his enemy wishes him to do.",
    "163": "It is easy to do things that are bad and unbeneficial to oneself, but it is, indeed, most difficult to do things that are beneficial and good.",
    "164": "The foolish man who, on account of his wrong views, scorns the teaching of homage-worthy Noble Ones (Ariyas) who live according to the Dhamma is like the bamboo which bears fruit for its own destruction.",
    "165": "By oneself indeed is evil done and by oneself is one defiled; by oneself is evil not done and by oneself is one purified. Purity and impurity depend entirely on oneself; no one can purify another.",
    "166": "For the sake of anothers benefit, however great it may be, do not neglect ones own (moral) benefit. Clearly perceiving ones own benefit one should make every effort to attain it.",
    "167": "Do not follow ignoble ways, do not live in negligence, do not embrace wrong views, do not be the one to prolong samsara (lit., the world).",
    "168": "Do not neglect the duty of going on alms-round; observe proper practice (in going on alms-round). One who observes proper practice lives happily both in this world and in the next.",
    "169": "Observe proper practice (in going on alms-round); do not observe improper practice. One who observes proper practice lives happily both in this world and in the next.",
    "170": "If a man looks at the world (i.e., the five khandhas) in the same way as one looks at a bubble or a mirage, the King of Death will not find him.",
    "171": "Come, look at this world (i.e., the five khandhas), which is like an ornamented royal carriage. Fools flounder in this world of the khandhas, but the wise are not attached to it",
    "172": "He, who has been formerly unmindful, but is mindful later on, lights up the world with the light of Magga Insight a; does the moon freed from clouds.",
    "173": "He who overwhelms with good the evil that he has done lights up this world (with the light of Magga Insight), as does the moon freed from clouds.",
    "174": "Blind are the people of this world: only a few in this world see clearly (with Insight). Just as only a few birds escape from the net, so also, only a few get to the world of the devas, (and Nibbana).",
    "175": "Swans travel in the sky; those with supernormal powers travel through space; the wise having conquered Mara together with his army, go out of this world (i. e., realize Nibbana).",
    "176": "For one who transgresses the Truth, and is given to lying, and who is unconcerned with the life hereafter, there is no evil that he dare not do.",
    "177": "Indeed, misers do not go to the abode of the devas; fools do not praise charity; but the wise rejoice in charity and so gain happiness in the life hereafter.",
    "178": "Far better than sovereignty over the earth, or far better than going to the abodes of the devas, or far better than ruling supreme over the entire universe, is (the attainment of) Sotapatti Fruition.",
    "179": "The Buddha, whose conquest (of moral defilements) is complete, in whom there cannot arise any further defilements in this world, that Buddha of infinite range of wisdom, who is trackless, by what track will you lead him? ",
    "180": "The Buddha, in whom there is no craving, which like a net would bring him back to any existence (in samsara),—that Buddha of infinite range of wisdom, who is trackless, by what track will you lead him?",
    "181": "The wise who practise jhana concentration and Insight Meditation take delight in the peace of liberation from sensual pleasures and moral defilements. Such wise and mindful ones, who truly comprehend the Four Noble Truths (i.e., arahats and Buddhas) are held dear also by the devas. ",
    "182": "Hard to gain is birth as man; hard is the life of mortals; hard to get is the opportunity of hearing the Ariya Dhamma (Teaching of the Buddhas); hard it is for a Buddha to appear. ",
    "183": "Not to do evil, to cultivate merit, to purify ones mind—this is the Teaching of the Buddhas. ",
    "184": "The best moral practice is patience and forbearance; \"Nibbana is Supreme\", said the Buddhas. A bhikkhu does not harm others; one who harms others is not a bhikkhu. ",
    "185": "Not to revile, not to do any harm, to practise restraint according to the Fundamental Instructions for the bhikkhus, to be moderate in taking food, to dwell in a secluded place, to devote oneself to higher concentration— this is the Teaching of the Buddhas.",
    "186": "Not by a shower of coins can sensual desires be satiated; sensual desires give little pleasure and are fraught with evil consequences (dukkha).",
    "187": "Knowing this, the wise man, who is the disciple of the Buddha, does not find delight even in the pleasures of the devas, but rejoices in the cessation of craving (i.e., Nibbana). ",
    "188": "When threatened with danger, men go to many a refuge,— to mountains and forests, to parks and gardens, and to sacred trees. ",
    "189": "But such a refuge is not a safe refuge, not the best refuge. One is not liberated from all evil consequences of existence (dukkha) for having come to such a refuge. ",
    "190": "One, who takes refuge in the Buddha, the Dhamma and the Samgha, sees with Magga Insight the Four Noble Truths,",
    "191": "viz., Dukkha, the Cause of Dukkha, the Cessation of Dukkha, and the Noble Path of Eight Constituents which leads to the Cessation of Dukkha. ",
    "192": "This, indeed, is the safe refuge; this is the best refuge. Having come to this refuge, one is liberated from all dukkha.",
    "193": "It is hard to find the noblest of men; he is not born everywhere nor in every clan. To whatever clan such a wise man is born, that clan prospers. ",
    "194": "Happy is the arising of a Buddha; happy is the exposition of the Ariya Dhamma; happy is the harmony amongst the Samgha; happy is the practice of those in harmony. ",
    "195": "He pays homage to those who are worthy of veneration, whether they are the Buddhas or their disciples who have overcome obstacles (to Insight Development) and have rid themselves of sorrow and lamentation. ",
    "196": "The merit gained by such a person who pays homage to those who have been freed from moral defilements arid have nothing to fear, cannot be measured by anyone, as this much or that much.",
    "197": "Indeed we live very happily, not hating anyone among those who hate; among men who hate we live without hating anyone.",
    "198": "Indeed we live very happily, in good health among the ailing; among men who are ailing we live in good health.",
    "199": "Indeed we live very happily, not striving (for sensual pleasures) among these who strive (for them); among those who strive (for them) we live without striving.",
    "200": "Indeed we live very happily, without any anxiety (i.e., without greed, ill will and ignorance); like the Abhassara brahmas we shall live on delightful satisfaction (piti) as our food.",
    "201": "Conquest begets enmity; the conquered live in misery; the peaceful live happily having renounced conquest and defeat.",
    "202": "There is no fire like passion; there is no evil like hatred; there is no ill like (the burden of) khandhas; there is no bliss that surpasses the Perfect Peace (i.e., Nibbana).",
    "203": "Hunger is the greatest ailment, khandhas are the greatest ill. The wise, knowing them as they really are, realize Nibbana, the greatest bliss.",
    "204": "Health is the greatest gift, contentment is the greatest wealth, a trusted friend is the best relative, Nibbana is the greatest bliss.",
    "205": "Having had the taste of solitude and the taste of Perfect Peace of Nibbana, one who drinks in the joy of the essence of the Dhamma is free from fear and evil.",
    "206": "It is good to see the Noble Ones (ariyas); to live with them is always a pleasure; not seeing fools is also always a pleasure.",
    "207": "He who walks in the company of fools has to grieve for a long time. Association with fools is ever painful, as living with an enemy; association with the wise is a pleasure, as living with relatives.",
    "208": "Therefore one should follow a resolute, intelligent, learned, persevering and dutiful ariya; follow such a virtuous and wise man, as the moon follows the path of the stars. ",
    "209": "He who does what should not be done and fails to do what should be done, who forsakes the noble aim of life (i. e., Morality, Concentration and Insight) and grasps at sensual pleasure, covets the benefits gained by those who exert themselves (in meditation).",
    "210": "Do not associate with those who are dear, and never with those who are not dear to you; not seeing the dear ones is painful, and seeing those who are not dear to you is also painful.",
    "211": "Therefore, one should hold nothing dear; separation from the loved ones is painful; there are no fetters for those who do not love or hate.",
    "212": "Affection begets sorrow, affection begets fear. For him who is free from affection there is no sorrow; how can there be fear for him?",
    "213": "Endearment begets sorrow, endearment begets fear. For him who is free from endearment there is no sorrow; how can there be fear for him?",
    "214": "Attachment (to sensual pleasures) begets sorrow, attachment begets fear. For him who is free from attachment there is no sorrow; how can there be fear for him?",
    "215": "Lust begets sorrow, lust begets fear. For him who is free from lust there is no sorrow; how can there be fear for him?",
    "216": "Craving begets sorrow, craving begets fear. For him who is free from craving there is no sorrow; how can there be fear for him?",
    "217": "He who is endowed with Virtue and Insight, who is established in the Dhamma, who has realized the Truth and performs his own duties, is loved by all men.",
    "218": "He who has developed a desire for the Ineffable (i.e., Nibbana), whose mind reaches the same, and is no longer attached to the sensual world (kamaloka), is called one who is bound upstream (uddhamsoto).",
    "219": "A man who has long been absent and has returned home safely from a distance is welcomed with joy by relatives, friends and well-wishers on his return.",
    "220": "In the same way, his good deeds will receive him who has done good when he goes from this world to the other, as relatives receive a dear one on his return.",
    "221": "Give up anger, abandon conceit, overcome all fetters. Ills of life (dukkha) do not befall one who does not cling to mind and body and is free from moral defilements,",
    "222": "He who restrains his rising anger as a skilful charioteer checks a speeding chariot,—him I call a true charioteer; other charioteers only hold the reins.",
    "223": "Conquer the angry one by not getting angry (i. e., by loving-kindness); conquer the wicked by goodness; conquer the stingy by generosity, and the liar by speaking the truth.",
    "224": "One should speak the truth, one should not yield to anger, one should give when asked even if it is only a little. By means of these three one may go to the world of the devas.",
    "225": "The arahats, who do not harm others and are always restrained in their actions, go to the deathless Nibbana, where there is no sorrow.",
    "226": "In those who are ever vigilant, who by day and by night train themselves in the three sikkhas (i.e., sila, samadhi and panna), and who have their mind directed towards Nibbana, moral intoxicants become extinct.",
    "227": "It is not new, O Atula! It has always been done from ancient times. They blame one who is silent, they blame one who speaks much, they blame one who speaks little. There is no one in this world who is not blamed.",
    "228": "There never has been, there never will be, nor is there now, anyone who is always blamed or always praised.",
    "229": "If the wise praise him day after day, knowing him to be truly faultless, wise and endowed with knowledgc and virtue,",
    "230": "who would blame him, who is like a nikkha of pure gold? The devas praise him; he is praised even by the great Brahmas.",
    "231": "Guard against evil deeds, control your body. Giving up evil deeds, cultivate good deeds.",
    "232": "Guard against evil speech, control your speech. Giving up evil speech, cultivate good speech.",
    "233": "Guard against evil thoughts, control your mind. Giving up evil thoughts, cultivate good thoughts.",
    "234": "The wise are controlled in deed, they are controlled in speech, they are controlled in thought. Indeed, they are perfectly self-controlled.",
    "235": "You are now like a withered leaf; the messengers of death are near you; you are about to set out on a long journey; (yet), you have no provisions (for the journey).",
    "236": "Make a firm support for yourself; hasten to strive hard, and be wise. Having removed impurities and being free from moral defilements you shall enter the abodes of the Ariyas (i.e., Suddhavasa brahma realm).",
    "237": "Now you are of advanced age; you are going to the presence of the King of Death and you cannot stop on the way; (yet) you have no provisions (for the journey).",
    "238": "Make a firm support for yourself; hasten to strive hard, and be wise. Having removed impurities and being free from moral defilements you will no longer be subject to rebirth and decay.",
    "239": "By degrees, little by little, from moment to moment a wise man removes his own impurities (moral defilements), as a smith removes the dross of silver or gold.",
    "240": "Just as rust is formed from iron, and corrodes the iron from which it is formed, so also, his own deeds lead the transgressor to a lower plane of existence (duggati). ",
    "241": "Non-recitation is the taint of learning; non--maintenance is the taint of houses; indolence is the taint of beauty; unmindfulness is the taint of one who keeps watch.",
    "242": "Sexual misconduct is the taint of a woman; stinginess is the taint of a giver; evil ways are indeed taints in this world as well as in the next.",
    "243": "A taint worse than these is ignorance (of the Truth), which is the greatest of taints. O bhikkhus, abandon this taint and be taintless.",
    "244": "Life is easy for one who is shameless and bold as a crow, who slanders others and is pretentious, aggressive and corrupt.",
    "245": "Life is hard for one with a sense of shame, who always seeks purity, who is free from attachment, who is modest and who sees clearly what is proper livelihood.",
    "246": "He who destroys life, tells lies, takes what is not given him, commits adultery",
    "247": "and takes intoxicating drinks, digs up his own roots even in this very life.",
    "248": "Know this, O man! Not restraining oneself is evil; do not let greed and ill will subject you to prolonged misery.",
    "249": "People give according to their faith and their devotion; one who is displeased with others receiving food and drink cannot attain concentration (samadhi) by day or by night.",
    "250": "He who has this feeling of displeasure cut off, uprooted and removed, will surely attain concentration (samadhi) by day or by night. .",
    "251": "There is no fire like passion, there is no grip like ill will, there is no net like ignorance, there is no river like craving.",
    "252": "It is easy to see the faults of others, but difficult to see ones own. A man broadcasts the fault; of others like winnowing chaff in the wind, but hides his own faults as a crafty fowler covers himself.",
    "253": "In one who constantly sees the faults of others and is always disparaging them, moral intoxicants (asavas) increase; he is far from extinction of moral intoxicants (i.e., he is far from attainment of arahatship). ",
    "254": "In the sky there is no track; outside the Buddhas Teaching there is no ariya bhikkhu (samana). All beings take delight in fetters (i.e., craving, pride and wrong view) that prolong samsara; all the Buddhas are free from these fetters.",
    "255": "In the sky there is no track; outside the Buddhas Teaching there is no ariya bhikkhu (samana). There is no conditioned thing that is permanent; all the Buddhas are unperturbed (by craving, pride and wrong view).",
    "256": "He is not just if he decides a case arbitrarily; the wise man should decide after considering both what is right and what is wrong.",
    "257": "The wise man who decides not arbitrarily but in accordance with the law is one who safeguards the law; he is to be called one who abides by the law (dhammattho). ",
    "258": "He is not a wise man just because he talks much; only he who is peaceful, free from enmity, and does no harm to others, is to be called a wise man. ",
    "259": "He is not \"one versed in the Dhamma (Dhammadhara)\" just because he talks much. He who hears only a little but comprehends the Dhamma, and is not unmindful is, indeed, \"one versed in the Dhamma.\" ",
    "260": "He is not a thera just because his head is grey; he who is ripe only in years is called \"one grown old in vain.\"",
    "261": "Only a wise man who comprehends the Four Noble Truths and the Dhamma, who is harmless and virtuous, who restrains his senses and has rid himself of moral defilements is indeed called a thera.",
    "262": "Not by fine talk, nor by good looks could one be a good-hearted man, if he were envious, miserly and crafty.",
    "263": "A wise man who has cut off, uprooted and removed these and has rid himself of moral defilements is indeed called a good-hearted man.",
    "264": "Not by a shaven head does a man become a samana, if he lacks morality and austere practices and tells lies. How could he who is full of covetousness and greed be a samana?",
    "265": "He who has totally subdued all evil, great and small, is called a samana because he has overcome all evil.",
    "266": "He does not become a bhikkhu merely because he stands at the door for alms. He cannot become a bhikkhu because he acts according to a faith which is not in conformity with the Dhamma.",
    "267": "In this world, he who lays aside both good and evil, who leads the life of purity, and lives meditating on the khandha aggregates is indeed called a bhikkhu.",
    "268": "Not by silence does one become a muni, if one is dull and ignorant.",
    "269": "Like one holding a pair of scales, the wise one takes what is good and rejects what is evil. For this reason he is a muni. He who understands both internal and external aggregates is also, for that reason, called a muni. ",
    "270": "He who harms living beings is, for that reason, not an ariya (a Noble One); he who does not harm any living being is called an ariya.",
    "271": "Not by mere moral practice, nor by much learning, nor by acquiring concentration, nor by dwelling in seclusion,",
    "272": "nor by assuring oneself \"I enjoy the bliss of Anagami Fruition that is not enjoyed by common worldlings (puthujjanas )\" should the bhikkhu rest content without attaining the extinction of moral intoxicants (asavas) [i.e., without attaining arahatship].",
    "273": "Of paths, the Path of Eight Constituents is the noblest; of truths, the Four Noble Truths are the noblest; of the dhammas, the absence of craving (i.e., Nibbana) is the noblest; of the two-legged beings, the All-Seeing Buddha is the noblest.",
    "274": "This is the only Path, and there is none other for the purity of vision. Follow this Path; it will bewilder Mara.",
    "275": "Following this Path, you will make an end of dukkha. Having myself known the Path which can lead to the removal of the thorns of moral defilements, I have shown you the Path.",
    "276": "You yourselves should make the effort; the Tathagatas (Buddhas) only can show the way. Those who practise the Tranquillity and Insight Meditation are freed from the bond of Mara.",
    "277": "\"All conditioned phenomena are impermanent\"; when one sees this with Insight-wisdom, one becomes weary of dukkha,(i.e., the khandhas). This is the Path to Purity.",
    "278": "\"All conditioned phenomena are dukkha\"; when one sees this with Insight-wisdom, one becomes weary of dukkha (i. e., the khandhas). This is the Path to Purity.",
    "279": "\"All phenomena (dhammas) are without Self\"; when one sees this with Insight-wisdom, one becomes weary of dukkha (i. e., the khandhas). This is the Path to Purity.",
    "280": "The idler who does not strive when he should be striving, who though young and strong is given to idleness, whose thoughts are weak and wandering, will not attain Magga Insight which can only be perceived by wisdom. ",
    "281": "One should be careful in speech, be well-restrained in mind, and physically, too, one should do no evil. One should purify these three courses of action and accomplish the practice of the Path of Eight Constituents made known by the Buddhas. ",
    "282": "Indeed, wisdom is born of meditation; without meditation wisdom is lost. Knowing this twofold path of gain and loss of wisdom, one should conduct oneself so that wisdom may increase.",
    "283": "O bhikkhus, cut down the forest of craving, not the real tree; the forest of craving breeds danger (of rebirth). Cut down the forest of craving as well as its undergrowth and be free from craving.",
    "284": "So long as craving of man for woman is not cut down and the slightest trace of it remains, so long is his mind in bondage as the calf is bound to its mother.",
    "285": "Cut off your craving as one plucks an autumn lily with the hand. Nibbana has been expounded on by the Buddha; cultivate that Path which leads to it.",
    "286": "\"Here will I live in the rainy season; here will I live in the cold season and the hot season\", so imagines the fool, not realizing the danger (of approaching death).",
    "287": "The man who dotes on his children and his herds of cattle, whose mind longs for and is attached to sensual pleasures, is carried away by Death even as a sleeping village is swept away by a great flood.",
    "288": "Not sons, nor parents, nor close relatives can protect one assailed by Death; indeed, neither kith nor kin can give protection.",
    "289": "Knowing this, the wise man restrained by morality should quickly clear (the obstacles to) the Path leading to Nibbana.",
    "290": "If by giving up small pleasures great happiness is to be found, the wise should give up small pleasures seeing (the prospect of) greet happiness.",
    "291": "He who seeks his own happiness by inflicting pain on others, being entangled by bonds of enmity, cannot be free from enmity.",
    "292": "In those who leave undone what should indeed be done but do what should not be done, who are conceited and unmindful, moral intoxicants increase.",
    "293": "In those who always make a good effort in meditating on the body, who do not do what should not be done but always do what should be done, who are also mindful and endowed with clear comprehension, moral intoxicants come to an end.",
    "294": "Having killed mother (i.e.., Craving), father (i.e., Conceit), and the two kings (i.e., Eternity-belief and Annihilation-belief), and having destroyed the kingdom (i.e., the sense bases and sense objects) together with its revenue officer (i.e., attachment), the brahmana (i.e., the arahat) goes free from dukkha.",
    "295": "Having killed mother, father, the two brahmin kings and having destroyed the hindrances of which the fifth (i.e., doubt) is like a tiger-infested journey, the brahmana (i.e., the arahat) goes free from dukkha.",
    "296": "Fully alert and ever vigilant are Gotama Buddhas disciples, who by day and by night are always mindful of the qualities of the Buddha.",
    "297": "Fully alert and ever vigilant are Gotama Buddhas disciples, who by day and by night are always mindful of the qualities of the Dhamma.",
    "298": "Fully alert and ever vigilant are Gotama Buddhas disciples, who by day and by night are always mindful of the qualities of the Samgha.",
    "299": "Fully alert and ever vigilant are Gotama Buddhas disciples, who by day and by night are always mindful of the component parts of the body.",
    "300": "Fully alert and ever vigilant are Gotama Buddhas disciples, whose mind by day and by night always takes delight in being compassionate (lit., harmless).",
    "301": "Fully alert and ever vigilant are Gotama Buddhas disciples, whose mind by day and by night always takes delight in the cultivation (of good-will towards all)",
    "302": "It is hard to become a bhikkhu; it is hard to be happy in the practice of a bhikkhu. The hard life of a householder is painful; to live with those of a different temperament is painful. A traveller in samsara is continually subject to dukkha; therefore, do not be a traveller in samsara; do not be the one to be subject to dukkha again and again.",
    "303": "He who is full of faith and virtue, who also possesses fame and fortune, is held in reverence wherever he goes.",
    "304": "Like the Himalayas, the good are visible even from afar; like arrows shot in the night, the wicked are not seen even though they may be near.",
    "305": "He who sits alone, lies down alone, walks alone, in diligent practice, and alone tames himself should find delight in living in the forest.",
    "306": "One who tells lies (about others) goes to niraya; one who has done evil and says \"I did not do it\" also goes to niraya. Both of them being evil-doers, suffer alike (in niraya) in their next existence.   ",
    "307": "Many men wearing the yellow robe up to their necks who have an evil disposition and are unrestrained in thought, word and deed are reborn in niraya on account of their evil deeds. ",
    "308": "It is better for one to eat a red-hot lump of iron burning like a flame than to eat alms-food offered by the people, if one is without morality (sila) and unrestrained in thought, word and deed.",
    "309": "Four misfortunes befall a man who is unmindful of right conduct and commit sexual misconduct with another mans wife: acquisition of demerit, disturbed sleep, reproach, and suffering in niraya.",
    "310": "Thus, there is the acquisition of demerit, and there is rebirth in the evil apaya realms. The enjoyment of a scared man with a scared woman is short-lived, and the king also metes out severe punishment. Therefore, a man should not commit misconduct with another mans wife.",
    "311": "Just as kusa grass if badly held cuts that very hand, so also, the ill-led life of a bhikkhu drags that bhikkhu down to niraya.",
    "312": "An act perfunctorily performed, or a practice that is depraved, or a questionable conduct of a bhikkhu is not of much benefit.",
    "313": "If there is anything to be done, do it well; do it firmly and energetically; for the slack life of a bhikkhu scatters much dust (of moral defilements).",
    "314": "It is better not to do an evil deed; an evil deed torments one later on. It is better to do a good deed as one does not have to repent for having done it.",
    "315": "As a border town is guarded both inside and outside, so guard yourself. Let not the right moment go by for those who miss this moment come to grief when they fall into niraya.",
    "316": "Those beings who are ashamed of what should not be ashamed of, who are not ashamed of what should be ashamed of, and who hold wrong views go to a lower plane of existence (duggati).",
    "317": "Those beings who see danger in what is not dangerous, who do not see danger in what is dangerous, and who hold wrong views go to a lower plane of existence (duggati).",
    "318": "Beings who imagine wrong in what is not wrong, who do not see wrong in what is wrong, and who hold wrong views go to a lower plane of existence (duggati).",
    "319": "Beings who know what is wrong as wrong. who know what is right as right, and who hold right views go to a happy plane of existence (suggati).",
    "320": "As an elephant in battlefield withstands the arrow shot from a bow, so shall I endure abuse. Indeed, many people are without morality.",
    "321": "Only the trained (horses and elephants) are led to gatherings of people; the King mounts only the trained (horses and elephants). Noblest among men are the tamed, who endure abuse.",
    "322": "Mules, thoroughbred horses, horses from Sindh, and great elephants are noble only when they are trained; but one who has tamed him self (through Magga Insight) is far nobler.",
    "323": "Indeed, not by any means of transport (such as elephants and horses) can one go to the place one has never been before (i.e., Nibbana); but by thoroughly taming oneself, the tamed one can get to that place (i.e., Nibbana).",
    "324": "The elephant called Dhanapala, in severe must and uncontrollable, being in captivity, eats not a morsel, yearning for his native forest (i. e., longing to look after his parents).",
    "325": "The stupid one who is lazy, gluttonous, and drowsy, who just wallows like a well-fed pig, is subject to repeated rebirths.",
    "326": "In the past, this mind has wandered as it liked, wherever it liked, at its own pleasure. Now I will control my mind wisely, as a mahout with his goad controls an elephant in must.",
    "327": "Take delight in mindfulness, guard your mind well. As an elephant stuck in mire pulls itself out, so also, pull yourself out of the mire of moral defilements.",
    "328": "If one finds a sagacious friend, who is a virtuous and steadfast companion, one should live with him joyfully and mindfully, overcoming all dangers.",
    "329": "If one cannot find a sagacious friend, who is a virtuous and steadfast companion, one should live alone like the king who gave up and left the country he had won, and like the elephant Matanga roaming alone in the forest.",
    "330": "It is better to live alone; there is no fellowship with a fool. So one should live alone, do no evil, and be carefree like the elephant Matanga roaming alone in the forest.",
    "331": "It is good to have friends when the need arises; it is good to be content with anything that is available; it is good to have merit when life is about to end; it is good to be rid of all dukkha.",
    "332": "In this world it is good to be dutiful to ones mother; also it is good to be dutiful to ones father. In this world it is good to minister unto samanas; also it is good to minister unto brahmanas.",
    "333": "It is good to have virtue till old age, it is good to have unshakable faith, it is good to gain wisdom, it is good to do no evil.",
    "334": "In a man who is unmindful craving grows like a creeper. He runs from birth to birth, like a monkey seeking fruits in the forest.",
    "335": "In this world, sorrow grows in one who is overwhelmed by this vile craving that clings to the senses, just as well-watered birana grass grows luxuriantly.",
    "336": "In this world, sorrow falls away from one who overcomes this vile craving that is difficult to get rid of, just as water drops fall away from a lotus leaf.",
    "337": "Therefore, I will deliver this worthy discourse to all of you who have assembled here. Dig up the root of craving just as one who wishes to have the fragrant root digs up the birana grass. Do not let Mara destroy you again and again, as the flood destroys the reed.",
    "338": "Just as a tree with roots undamaged and firm grows again even though cut down, so also, if latent craving is not rooted out, this dukkha (of birth, ageing and death) arises again and again.",
    "339": "That man of wrong views, in whom the thirty-six streams (of craving) that flow towards pleasurable objects are strong, is carried away by his many thoughts connected with passion.",
    "340": "The stream of craving flows towards all sense objects; the creeper of craving arises (at the six sense-doors) and fixes itself (on the six sense objects). Seeing that creeper of craving growing, cut off its roots with Magga Insight.",
    "341": "In beings, there flows happiness that is smeared with craving; those beings attached to pleasure and seeking pleasure are, indeed, subject to birth and ageing.",
    "342": "People beset with craving are terrified like a hare caught in a snare; held fast by fetters and bonds they undergo dukkha (round of rebirths) again and again, for a long time.",
    "343": "People beset with craving are terrified like a hare caught in a snare. Therefore, One who wishes to free himself from craving should eradicate craving. ",
    "344": "Having left the forest of desire (i.e., the life of a householder), he takes to the forest of the practice (i.e., the life of a bhikkhu); but when he is free from the forest of desire he rushes back to that very forest. Come, look at that man who having become free rushes back into that very bondage.",
    "345": "The wise do not say that bonds made of iron, of wood, and of hemp are strong bonds; they say that only passionate attachment to and care for gems and jewelry, children and wives are strong bonds.",
    "346": "These drag one down (to lower planes of existence) and although they seem yielding are difficult to unfasten. The wise, cutting off this bond (of craving) and resolutely giving up sensual pleasures, renounce the world.",
    "347": "Beings who are infatuated with lust fall back into the Stream of Craving they have generated, just as a spider does in the web it has spun. The Wise, cutting off the bond of craving, walk on resolutely, leaving, all ills (dukkha) behind.",
    "348": "Give up the past, give up the future, give up the present. Having reached the end of existences, with a mind freed from all (conditioned things), you will not again undergo birth and decay.",
    "349": "In a man who is disturbed by (sensual) thoughts, whose passions are strong, and who keeps seeing objects as being pleasant, craving grows more and more. Indeed, he makes his bondage strong.",
    "350": "A man who takes delight in calming (sensual) thoughts, who is ever mindful, and meditates on the impurity (of the body, etc.) will certainly get rid (of craving); this man will cut the bond of Mara.",
    "351": "He who has attained arahatship is free from fear, free from craving, and free from moral defilements. He has cut off the thorns of existence (such as lust). This is the last existence (for him).",
    "352": "He who is free from craving and from attachment, who is skilled in the knowledge of the significance of terms, who knows the grouping of letters and their sequence is indeed called \"one who has lived his last, a man of great wisdom, a great man.\"",
    "353": "I have overcome all, I know all, I am detached from all, I have given up all; I am liberated from moral defilements having eradicated craving, (i. e., I have attained arahatship). Having comprehended the Four Noble Truths by myself, whom should I point out as my teacher?",
    "354": "The gift of tile Dhamma excels all gifts; the taste of the Dhamma excels all tastes; delight in the Dhamma excels all delights. The eradication of Craving (i.e., attainment of arahatship) overcomes all ills (samsara dukkha).",
    "355": "Wealth destroys the foolish; but it cannot destroy those who seek the other shore (i. e., Nibbana). By his craving for wealth the fool destroys himself, as he would destroy others.",
    "356": "Weeds damage fields; lust spoils all beings. Therefore, giving to those free from lust yields great benefit.",
    "357": "Weeds damage fields; ill will spills all beings. Therefore, giving to those free from ill will yields great benefit.",
    "358": "Weeds damage fields; ignorance spoils all beings. Therefore, giving to those free from ignorance yields great benefit.",
    "359": "Weeds damage fields; covetousness spoils all beings. Therefore, giving to those free from covetousness yields great benefit.",
    "360": "Restraint in the eye is good, good is restraint in the ear; restraint in the nose is good, good is restraint in the tongue.",
    "361": "Restraint in body is good, good is restraint in speech; restraint in mind is good, good is restraint in all the senses. A bhikkhu restrained in all the senses is freed from all ills (Samsara dukkha).",
    "362": "He who controls his hand, controls his foot, controls his speech, and has complete control of himself; who finds delight in Insight Development Practice and is calm; who stays alone and is contented;— him they call a bhikkhu. ",
    "363": "The bhikkhu who controls his mouth (speech) who speaks wisely with his mind composed, who explains the meaning and the text of the Dhamma ,— sweet are the words of that bhikkhu.",
    "364": "The bhikkhu who abides in the Dhamma, who delights in the Dhamma, who meditates on the Dhamma, and is ever mindful of the Dhamma, does not fall away from the Dhamma of the virtuous.",
    "365": "One should not despise what one has received (by proper means), nor should one envy others their gains. The bhikkhu who envies others cannot attain Concentration (Samadhi).",
    "366": "Though he receives only a little, if a bhikkhu does not despise what he has received (by proper means), the devas will surely praise him who leads a pure life and is not slothful.",
    "367": "He who does not take the mind-and-body aggregate (nama-rupa) as \"I and mine\", and who does not grieve over the dissolution (of mind-and-body) is, indeed, called a bhikkhu.",
    "368": "The bhikkhu who lives exercising loving-kindness and is devoted to the Teaching of the Buddha will realize Nibbana—the Tranquil, the Unconditioned, the Blissful.",
    "369": "O bhikkhu, bale out the water (of wrong thoughts) from this boat (your body); when empty it will sail swiftly; having cut off passion and ill will you will realize Nibbana.",
    "370": "Cut off the five (the lower five fetters) give up the five (the upper five fetters); and develop the five (controlling faculties). The bhikkhu who has freed himself of the five bonds (passion, ill will, ignorance, pride and wrong view) is called \"One who has crossed the flood (of samsara).\"",
    "371": "O Bhikkhu, mediate, and do not be unmindful; do not let your mind rejoice in sensual pleasures. Do not be unmindful and swallow the (hot) lump of iron; as you burn (in niraya) do not cry, \"This, indeed, is suffering.\"",
    "372": "There can be no concentration in one who lacks wisdom; there can be no wisdom in one who lacks concentration. He who has concentration as well as wisdom is, indeed, close to Nibbana.",
    "373": "The bhikkhu who goes into seclusion (to meditate), whose mind is tranquil, who clearly perceives the Dhamma, experiences the joy which transcends that of (ordinary) men.",
    "374": "Every time he clearly comprehends the arising and the perishing of the khandhas, he finds joy and rapture. That, to the wise, is the way to Nibbana (the Deathless).",
    "375": "For a wise bhikkhu in this Teaching, this is the beginning (of the practice leading to Nibbana): control of the senses, contentment, and restraint according to the Fundamental Precepts.",
    "376": "Associate with good friends, who are energetic and whose livelihood is pure; let him be amiable and be correct in his conduct. Then, (frequently) feeling much joy he will make an end of dukkha (of the round of rebirths).",
    "377": "O bhikkhus! As the jasmin (vassika) plant sheds its withered flowers, so also, should you shed passion and ill will.",
    "378": "The bhikkhu who is calm in body, calm in speech, and calm in mind, who is well-composed and has given up (lit., vomited) worldly pleasures, is called a \"Tranquil One\".",
    "379": "O bhikkhu, by yourself exhort yourself, and examine yourself; thus guarding yourself and being mindful, you will live in peace.",
    "380": "One indeed is ones own refuge, (how could anyone else be ones refuge?) One indeed is ones own haven; therefore, look after yourself as a horse dealer looks after a thoroughbred.",
    "381": "The bhikkhu who frequently feels joy and is devoted to the Teaching of the Buddha will realize Nibbana— the Tranquil, the Unconditioned, the Blissful. ",
    "382": "A bhikkhu who, though young, devotes himself to the Teaching of the Buddha lights up the world, as does the moon freed from a cloud.",
    "383": "O brahmana, cut off the stream of craving with diligence, and abandon sense desires. O brahmana, perceiving the cessation of the conditioned, be an arahat who realizes Nibbana, the Unconditioned.",
    "384": "When the brahmana is well-established in the two dhammas (i.e., the practice of Tranquillity and Insight Meditation), then, in that knowing one, all fetters are destroyed.",
    "385": "Him I call a brahmana who has for him neither this shore (i.e., the sense-bases) nor the other shore (i.e., the sense objects ), and who is undistressed and free from moral defilements.",
    "386": "Him I call a brahmana, who dwells in seclusion practising Tranquillity and Insight Meditation and is free from taints (of moral defilements); who has performed his duties, and is free from moral intoxicants (asavas) and has reached the highest goal (arahatship).",
    "387": "By day shines the sun; by night shines the moon; in regalia shines the king; in meditation shines the arahat; but the Buddha in his glory shines at all times, by day and by night. ",
    "388": "Because he has discarded evil he is called a brahmana; because he lives calmly he is called a samana; and because he gets rid of his impurities he is called a pabbajita.",
    "389": "One should not strike a brahmana; a brahmana should not get angry with his assailant; it is shameful to strike a brahmana; it is more shameful to get angry with ones assailant.",
    "390": "For a brahmana there is no benefit at all if he does not restrain from anger to which his mind is prone. Inasmuch as one desists from the intention to harm, to that extent dukkha ceases. ",
    "391": "Him I call a brahmana who does no evil in deed or word or thought, who is restrained in these three respects.",
    "392": "If from somebody one should learn the Teaching of the Buddha, he should respectfully pay homage to that teacher, as a brahmin worships the sacrificial fire.",
    "393": "Not by wearing matted hair, nor by lineage, nor by caste, does one become a brahmana; only he who realizes the Truth and the Dhamma is pure; he is a brahmana.",
    "394": "O foolish one! What is the use of wearing matted hair? What is the use of Your wearing a garment made of antelope skin? In you, there is a forest (of moral defilements); you clean yourself only externally.",
    "395": "Him I call a brahamana who wears robes made from rags (picked up from a dust heap), who is lean with veins standing out, who meditates alone in the forest.",
    "396": "I do not call him a brahmana just because he is born from the womb of a brahmana mother. He is just a bhovadi brahmin if he is not free from moral defilements. Him I call a brahmana, who is free from moral defilements and from attachment.",
    "397": "Him I call a brahmana, who has cut off all fetters and is fearless, who is beyond attachment and is free from moral defilements.",
    "398": "Him I call a brahmana, who has cut the strap (of ill will), the thong (of craving) and the cord (of wrong views together with latent defilements), who has lifted the bar that fastens the door (of ignorance), and who knows the Truth,",
    "399": "Him I call a brahmana, who, without anger endures abuse, beating and being bound, and to whom the strength of patience is like the strength of an army. ",
    "400": "Him I call a brahmana, who is free from anger, who practises austerity, who is virtuous and free from craving, who is controlled in his senses and for whom this body (i.e., existence) is the very last. ",
    "401": "Him I call a brahmana, who does not cling to sensual pleasures, just as water does not cling to a lotus leaf, or the mustard seed to the tip of an awl.",
    "402": "Him I call a brahmana, who even in this existence realizes the end of dukkha (i.e., Nibbana), who has laid down the burden (of the khandhas) and who is free from moral defilements.",
    "403": "Him I call a brahmana, who is wise and is profound in his knowledge, who knows the right way from the wrong way, and who has attained the highest goal (i.e., arahatship).",
    "404": "Him I call a brahmana, who associates not with the householder or with the homeless one, or with both, who is free from sensual desire. and has few wants.",
    "405": "Him I call a brahmana, who has laid aside the use of force towards all beings, the perturbed as well as the unperturbed (i.e., arahats), and who does not kill or cause others to kill.",
    "406": "Him I call a brahmana, who is not hostile to those who are hostile, who is peaceful (i.e., has laid aside the use of force) to those with weapons, and who is without attachment to objects of attachment. ",
    "407": "Him I call a brahmana, from whom passion, ill will, pride and detraction have fallen off like a mustard seed from the tip of an awl.",
    "408": "Him I call a brahmana, who speaks gentle, instructive and true words, and who does not offend anyone by speech.",
    "409": "Him I call a brahmana, who, in this world takes nothing that is not given him, be it long or short, big or small, good or bad.",
    "410": "Him I call a brahmana, who has no desire either for this world or for the next, who is free from craving and from moral defilements.",
    "411": "Him I called a brahmana, who has no craving, who through knowledge of the Four Noble Truths is free from doubt, and has realized Nibbana the Deathless.",
    "412": "Him I call a brahmana, who, in this world, has transcended both ties good and evil; who is sorrowless and, being free from the taints of moral defilements, is pure.",
    "413": "Him I call a brahmana, who, like the moon (in a cloudless sky), is pure, clear and serene, and in whom craving for existence is extinct.",
    "414": "Him I call a brahmana, who, having traversed this dangerous swamp (of passion), this difficult road (of moral defilements), the ocean of life (samsara) and the darkness of ignorance (moha), and having crossed the fourfold Flood, has reached the other shore (Nibbana); who practises Tranquility and Insight Meditation, who is free from craving and from doubt, who clings to nothing and remains in perfect peace.",
    "415": "Him I call a brahmana, who, in this world, has given up sensual pleasures, and leaving the home-life has become a bhikkhu; who has eradicated sensual desires and has come to the end of existence.",
    "416": "Him I call a brahmana, who, in this world, has given up craving, and leaving the home-life has become a bhikkhu; who has eradicated craving and has come to the end of existence.",
    "417": "Him I call a brahmana, who has given up attachment to (sensual pleasures of) human life, has transcended attachment to (sensual pleasures of) deva life and is completely free from all attachment.",
    "418": "Him I call a brahmana, who has given up taking delight (in sensual pleasures) and not taking delight (in solitude); who has attained perfect peace and is free from moral defilements; who has overcome all the five khandhas (lit., the world) and is diligent.",
    "419": "Him I call a brahmana, who knows the death and rebirth of beings in every detail, who is detached, who follows the good practice and knows the Four Noble Truths.",
    "420": "Him I call a brahmana, whose destination the devas or gandhabbas or men do not know who has eradicated moral intoxicants and is an arahat.",
    "421": "Him I call a brahmana, who does not cling to the past, future and present khandha aggregates and who is free from moral defilements and attachment.",
    "422": "Him I call a brahmana, who is fearless like a bull, who is noble and diligent, who is a seeker of high moral virtues and a conqueror (of three Maras), who is free from craving, who has been cleansed of moral defilements and knows the Four Noble Truths.",
    "423": "Him I call a brahmana, who knows past existences, who sees the celestial as well as the lower worlds, who has reached the end of rebirths, who, with Magga Insight, has become an arahat and has accomplished all that is to be accomplished for the eradication of moral defilements."
}