{
    "1": "Mind precedes all knowables,\\nmind’s their chief, mind-made are they. \\nif with a corrupted mind\\none should either speak or act\\ndukkha follows caused by that,\\nas does the wheel the ox’s hoof.",
    "2": "Mind precedes all knowables,\\nmind’s their chief, mind-made are they. \\nif with a clear, a confident mind\\none should either speak or act \\nhappiness follows caused by that,\\nas one’s shadow ne’er departing.",
    "3": "Who bear within them enmity: \\n“He has abused and beaten me,\\ndefeated me and plundered me”, \\nhate is not allayed for them.",
    "4": "Who bear within no enmity: \\n“He has abused and beaten me,\\ndefeated me and plundered me”, \\nhate is quite allayed for them.",
    "5": "Never here by enmity\\nare those with enmity allayed, \\nthey are allayed by amity,\\nthis is a timeless Truth.",
    "6": "Still others do not understand \\nthat we must perish in this world, \\nthose who understand this,\\ntheir quarrels are allayed.",
    "7": "One who beauty contemplates, \\nwhose faculties are unrestrained, \\nin food no moderation knows,\\nis languid, who is indolent:\\nthat one does Màra overthrow \\nas wind a tree of little strength.",
    "8": "One who foulness contemplates, \\nwhose faculties are well-restrained, \\nin food does moderation know,\\nis full of faith, who’s diligent:\\nthat one no Màra overthrows,\\nas wind does not a rocky mount.",
    "9": "One who wears the stainless robe \\nwho’s yet not free from stain, \\nwithout restraint and truthfulness \\nfor the stainless robe’s unfit.",
    "10": "But one who is self-cleansed of stain, \\nin moral conduct firmly set,\\nhaving restraint and truthfulness\\nis fit for the stainless robe.",
    "11": "Conceiving the real in unreality \\nwhile seeing unreal the truly real, \\nroaming fields of thought ill-formed: \\nnever they at the real arrive.",
    "12": "That which is real they know as real, \\nthat unreal, to be unreal;\\nroaming fields of thought well-formed \\nthey at the real arrive.",
    "13": "Even as rain does penetrate\\na house that’s badly thatched, \\nlikewise lust does penetrate \\nthe mind uncultivated.",
    "14": "As rain does never penetrate \\na house that is well-thatched, \\nso lust does never penetrate \\nthe mind well-cultivated.",
    "15": "Here one grieves, one grieves hereafter, \\nin both wise does the evil-doer grieve; \\none grieves and is afflicted,\\none’s own base kammas seeing.",
    "16": "Here one joys, one joys hereafter,\\nin both wise does the merit-maker joy; \\none joys and one rejoices,\\none’s own pure kammas seeing.",
    "17": "Here one burns, one burns hereafter,\\nin both wise does the evil-doer burn;\\nEvil I’ve done, remorsefully one burns, \\nand more one burns passed to realms of woe.",
    "18": "Here one’s glad, one’s glad hereafter\\nin both wise is the merit-maker glad; \\n‘Merit I’ve made’, serenely one is glad, and\\nmore one’s glad passed to blissful states.",
    "19": "Though many sacred texts he chant \\nthe heedless man’s no practicer,\\nas cowherd counting others’ kine \\nin samanaship he has no share.",
    "20": "Though few the sacred texts he chant\\nin Dhamma does practice run,\\nclear of delusion, lust and hate,\\nwisdom perfected, with heart well-freed,",
    "21": "Heedfulness is the Deathless path, \\nheedlessness, the path to death. \\nThose who are heedful do not die, \\nheedless ones are like the dead.",
    "22": "The wise then, recognising this\\nas the distinction of heedfulness, \\npleased with the spheres of Noble Ones, \\nin heedfulness rejoice.",
    "23": "They meditate persistently, \\nconstantly they firmly strive,\\nthe steadfast to Nibbàna reach,\\nthe Unexcelled Secure from bonds.",
    "24": "Assiduous and mindful,\\npure kamma making, considerate, \\nrestrained, by Dhamma heedful living, \\nfor one such spreads renown.",
    "25": "By energy and heedfulness,\\nby taming and by self-control,\\nthe one who’s wise should make an isle \\nno flood can overwhelm.",
    "26": "Foolish folk of little wit\\nin heedlessness indulge,\\nthe one who’s wise guards heedfulness \\nkin to the greatest wealth.",
    "27": "Don’t indulge in heedlessness! \\nDon’t come near to sexual joys! \\nThe heedful and contemplative \\nattains abundant bliss.",
    "28": "When one who’s wise does drive away heedlessness by heedfulness,\\nhaving ascended wisdom’s tower steadfast, one surveys the fools, griefless, views the grieving folk,\\nas mountaineer does those below.",
    "29": "Among the heedless, heedful, among the sleepy, wide awake. As the swift horse outruns a hack so one of good wisdom wins.",
    "30": "Heedfulness is always praised, heedlessness is ever blamed. By heedfulness did Magha go to lordship of the gods.",
    "31": "The bhikkhu liking heedfulness, seeing fear in heedlessness, advances as a conflagration burning fetters great and small.",
    "32": "The bhikkhu liking heedfulness, seeing fear in heedlessness, never will he fall away,\\nnear is he to Nibbàna.",
    "33": "Mind agitated, wavering,\\nhard to guard and hard to check, one of wisdom renders straight as arrow-maker with a shaft.",
    "34": "As fish from watery home\\nis drawn and cast upon the land, even so flounders this mind while Màra’s Realm abandoning.",
    "35": "The mind is very hard to check and swift, it falls on what it wants. The training of the mind is good,\\na mind so tamed brings happiness.",
    "36": "The mind is very hard to see\\nand fine, it falls on what it wants.\\nOne who’s wise should guard the mind, a guarded mind brings happiness.",
    "37": "Drifting far, straying all alone, formless, recumbent in a cave.\\nThey will be free from Màra’s bonds who do restrain this mind.",
    "38": "One of unsteady mind,\\nwho doesn’t know True Dhamma, who is of wavering confidence wisdom fails to win.",
    "39": "One of unflooded mind,\\na mind that is not battered, abandoning evil, merit too, no fear for One Awake.",
    "40": "Having known this urn-like body, made firm this mind as fortress town, with wisdom-weapon one fights Màra while guarding booty, unattached.",
    "41": "Not long alas, and it will lie\\nthis body, here upon the earth. Discarded, void of consciousness, useless as a rotten log.",
    "42": "Whatever foe may do to foe, or haters those they hate\\nthe ill-directed mind indeed can do one greater harm.",
    "43": "What one’s mother, what one’s father, whatever other kin may do,\\nthe well-directed mind indeed\\ncan do one greater good.",
    "44": "Who will comprehend this earth,\\nthe world of Yama, and the gods? Who discern the well-taught Dhamma as one who’s skilled selects a flower?",
    "45": "One Trained will comprehend this earth, the world of Yama, and the gods,\\nOne Trained discern the well-taught Dhamma as one who’s skilled selects a flower.",
    "46": "Having known this froth-like body and wakening to its mirage-nature, smashing Màra’s flowered shafts unseen beyond the Death-king go.",
    "47": "For one who has a clinging mind and gathers only pleasure-flowers, Death does seize and carry away as great flood a sleeping village.",
    "48": "For one of desires insatiate\\nwho gathers only pleasure-flowers, for one who has a clinging mind Death the sovereign overpowers.",
    "49": "Just as a bee in a flower harming neither hue nor scent gathers nectar, flies away,\\nso in towns a Wise One fares.",
    "50": "Not others’ opposition\\nnor what they did or failed to do, but in oneself should be sought things done, things left undone.",
    "51": "Just as a gorgeous blossom brilliant but unscented,\\nso fruitless the well-spoken words of one who does not act.",
    "52": "Just as a gorgeous blossom brilliant and sweet-scented,\\nso fruitful the well-spoken words of one who acts as well.",
    "53": "As from a mass of flowers\\nmany a garland may be made,\\nso by one born mortal\\nshould many good deeds be done.",
    "54": "The fragrance of flowers drifts with the wind as sandalwood, jasmine or lavender.\\nThe fragrance of virtue o’ersweeps the wind, all pervasive is virtue of the good.",
    "55": "Sandalwood or lavender, lotus or the jasmine great,\\nof these many fragrances virtue’s fragrance is supreme.",
    "56": "Faint is this fragrance\\nof lavender and sandalwood, but fragrance of the virtuous soars sublime amongst the gods.",
    "57": "Of those with perfect virtue who dwell in heedfulness, freed by Final Knowledge: Màra cannot know their path.",
    "58": "As beside the high road\\nwhere rubbish in a pit is flung there flourishes the lotus bloom fragrant and the mind’s delight.",
    "59": "So among rubbish-beings, common humans blind become, the Perfect Buddha’s pupil Outshines with wisdom bright.",
    "60": "Long is the night for the sleepless, long the league for the weary one, saüsàra’s way is long for fools who know not Dhamma True.",
    "61": "If a wayfarer fails to find\\none better or one equal, steadfast he should fare alone for with a fool’s no fellowship.",
    "62": "“Sons have I, wealth have I”, thus the fool is fretful.\\nHe himself is not his own,\\nhow then are sons, how wealth?",
    "63": "Conceiving so his foolishness the fool is thereby wise, while ‘fool’ is called that fool conceited that he’s wise.",
    "64": "Though all through life the fool might wait upon the wise,\\nno more the Dhamma can he sense than spoon the taste of soup.",
    "65": "Though briefly one intelligent might wait upon the wise, quickly Dhamma he can sense as tongue the taste of soup.",
    "66": "Fools of feeble wisdom fare enemies to themselves, making evil kamma\\nwhich is of bitter fruit.",
    "67": "That kamma’s not well-made\\nfrom which there is remorse,\\nof which one senses the result\\nwith weeping and a tear-stained face.",
    "68": "But well-made is that kamma which done brings no remorse, of which one senses the result with glad mind and with joy.",
    "69": "When evil kamma’s immature the fool thinks it is honeyed, but when the evil has matured then to the fool comes dukkha.",
    "70": "Month after month with bladey-grass tip the fool may take his food;\\nhe’s not worth the slightest bit\\nof one who Dhamma knows.",
    "71": "As milk, is evil kamma done,\\nso slowly does it sour. Smouldering does it follow the fool like fire with ashes covered.",
    "72": "Truly to his detriment skill is born to the fool; ruined is his better nature and scattered are his wits.",
    "73": "For position a fool may wish: among the bhikkhus precedence, in monasteries authority,\\nfrom other families honour.",
    "74": "Both monks and laymen, let them think ‘This was done by me,\\nwhatever the works, both great and small, let them depend on me’.\\nSuch the intention of a fool,\\nswollen his greed and conceit.",
    "75": "One is the way to worldly gain, another to Nibbàna goes.\\nClearly comprehending this\\nthe bhikkhu, Buddha’s follower should wallow not in proffered gifts, surrendering instead to solitude.",
    "76": "Should one a man of wisdom meet who points out faults and gives reproof, who lays a hidden treasure bare,\\nwith such a sage should one consort. Consorting so is one enriched\\nand never in decline.",
    "77": "Let him exhort, let him instruct, and check one from abasement. Dear indeed is he to the true, not dear is he to the false.",
    "78": "Don’t go around with evil friends, with rogues do not consort.\\nSpend your time with noble friends, with worthy ones consort.",
    "79": "Happy is he who Dhamma drinks with heart that’s clear and cool. One so wise e’er delights\\nin Dhamma declared by the Noble.",
    "80": "Irrigators govern waters,\\nfletchers fashion shafts,\\nas joiners shape their timber\\nthose who are wise tame themselves.",
    "81": "Just as a mighty boulder stirs not with the wind,\\nso the wise are never moved either by praise or blame.",
    "82": "Even as a fathomless lake, a lake so calm and clear, so dhammas having heard serene the wise become.",
    "83": "Everything the good renounce,\\nthe peaceful chatter not of fond delights, and whether touched by pleasure or pain nor joy nor woe in the wise is seen.",
    "84": "Neither for one’s own, nor for another’s sake one should wish for children, wealth, estate, nor success desire by means unjust,\\nthus virtuous and wise, righteous one would be.",
    "85": "Among folk they are few who go to the Further Shore, most among humanity scurry on this hither shore.",
    "86": "But they who practise Dhamma according to Dhamma well-told, from Death’s Dominion hard to leave they’ll cross to the Further Shore.",
    "87": "Abandoning the Dhammas dark\\nthe wise should cultivate the bright, having from home to homeless gone in solitude unsettling.",
    "88": "Let them desire that rare delight, renouncing pleasures, owning nought, those wise ones should cleanse themselves from all defilements of the mind.",
    "89": "Those who come to Wakening\\nwith mind full-cultivated,\\ndelight, no longer clinging,\\nin relinquishing attachment:\\nthey, without pollution, radiant,\\nin this world have reached Nibbàna.",
    "90": "With journey finished and sorrowless, from everything completely free,\\nfor one who’s loosened all the ties passion’s fever is not found.",
    "91": "Mindful Ones exert themselves,\\nin no abode do they delight,\\nas swans abandoning their lake home after home they leave behind.",
    "92": "For those who don’t accumulate, who well reflect upon their food, they have as range the nameless and the void of perfect freedom too.\\nAs birds that wing through space, hard to trace their going.",
    "93": "For whom pollutions are destroyed, not attached to any food,\\nhe has as range the nameless and the void of perfect freedom too.\\nAs birds that wing through space, hard to trace his going.",
    "94": "Whose faculties are pacified\\nas steeds by charioteer well-tamed, with pride abandoned, unpolluted, to even devas this One’s dear.",
    "95": "Like earth is one who is well-behaved, secure and not resentful,\\nas city-post, as filth-free lake,\\nno wanderings-on for One Who’s Thus.",
    "96": "Peaceful his mind and peaceful his speech, and action too, perfect in knowledge of freedom, One Thus is of utmost peace.",
    "97": "With no beliefs, the Unmade known, with fetters finally severed,\\nwith kammas cut and cravings shed, attained to humanity’s heights.",
    "98": "Whether in town or woods, whether in vale, on hill. wherever dwell the Arahants so pleasing there the earth.",
    "99": "Delightful are the forests where folk do not delight, there the Passionless delight, they’re not pleasure-seekers.",
    "100": "Though a thousand speeches be composed of meaningless lines, better the single meaningful line one hears, then comes to calm.",
    "101": "Though a thousand verses be composed of meaningless lines, better the single line of verse one hears, then comes to calm.",
    "102": "Though one a hundred verses chant \\ncomposed of meaningless lines, \\nbetter the single Dhamma-line\\none hears, then comes to calm.",
    "103": "Though thousand times a thousand in battle one may conquer,\\nyet should one conquer just oneself one is the greatest conqueror.",
    "104": "Greater the conquest of oneself\\nthan subjugating others,\\nthat one who’s always well-restrained, that one who’s tamed of self —",
    "105": "Neither deva nor minstrel divine, nor Màra together with Brahma, can overthrow the victory\\nof such a one as this.",
    "106": "Month by month for a hundred years a thousand one might sacrifice,\\nbut if for only a moment one\\nmight honour the self-developed, such honour then were better by far than a century of sacrifice.",
    "107": "One might tend for a hundred years the forest’s sacred fire,\\nbut if for only a moment one\\nmight honour the self-developed, such honour then were better by far than a century of sacrifice.",
    "108": "Whatever one who merit seeks should for a year make sacrifice, all comes not to a quarter part of honouring the Noble.",
    "109": "For one of respectful nature\\nwho ever the elders honours,\\nlong life and beauty, joy and strength, these qualities increase.",
    "110": "Though one should live a hundred years foolish, uncontrolled,\\nyet better is life for a single day\\nmoral and meditative.",
    "111": "Though one should live a hundred years foolish, uncontrolled,\\nyet better is life for a single day\\nwise and meditative.",
    "112": "Though one should live a hundred years lazy, of little effort,\\nyet better is life for a single day\\nstrongly making effort.",
    "113": "Though one should live a hundred years not seeing rise and fall,\\nyet better is life for a single day\\nseeing rise and fall.",
    "114": "Though one should live a hundred years not seeing the Deathless State,\\nyet better is life for a single day\\nseeing Deathlessness.",
    "115": "Seeing Dhamma Supreme.\\nThough one should live a hundred years not seeing Dhamma Supreme,\\nyet better is life for a single day",
    "116": "Make haste towards the good and check the mind from evil. The one who’s slow to merit make delights the mind in evil.",
    "117": "If one should some evil do then do it not again, again. Do not wish for it anew for evil grows to dukkha.",
    "118": "If one should some merit make do it then again, again.\\nOne should wish for it anew for merit grows to joy.",
    "119": "As long as evil ripens not\\neven the evil one goodness knows, but when the evil ripens\\nthen that person evil knows.",
    "120": "As long as goodness ripens not even the good one evil knows, but when the goodness ripens then that person knows the good.",
    "121": "Think lightly not of evil, ‘It will not come to me’,\\nfor by the falling of water drops a water jar is filled.\\nThe fool with evil fills himself, he soaks up little by little.",
    "122": "Think lightly not of goodness, ‘It will not come to me’,\\nfor by the falling of water drops\\na water jar is filled.\\nThe sage with goodness fills himself, he soaks up little by little.",
    "123": "As merchant on a perilous path, great wealth having but little guard, as life-loving man with poison\\nso with evils heedful be.",
    "124": "If in the hand’s no wound poison one may bear.\\nA woundless one is poisoned not, non-doers have no evil.",
    "125": "Who offends the inoffensive,\\nthe innocent and blameless one, upon that fool does evil fall\\nas fine dust flung against the wind.",
    "126": "Some find birth within a womb, evil-doers quicken in hell, good-farers to the heavens go, the Unpolluted wholly cool.",
    "127": "Neither in sky nor surrounded by sea, nor by dwelling in a mountain cave, nowhere is found that place on earth where one’s from evil kamma free.",
    "128": "Neither in sky nor surrounded by sea, nor by dwelling in a mountain cave, nowhere is found that place on earth where one’s by death not overcome.",
    "129": "All tremble at force,\\nof death are all afraid. Likening others to oneself kill not nor cause to kill.",
    "130": "All tremble at force,\\ndear is life to all. Likening others to oneself kill not nor cause to kill.",
    "131": "Whoever harms with force those desiring happiness, as seeker after happiness one gains no future joy.",
    "132": "Whoever doesn’t harm with force those desiring happiness,\\nas seeker after happiness\\none then gains future joy.",
    "133": "Speak not harshly to other folk, speaking so, they may retort.\\nDukkha indeed is quarrelsome speech and force for force may hurt you.",
    "134": "If like a broken gong\\nnever you reverbrate, quarrelling’s not part of you, that Nibbàna’s reached.",
    "135": "As with force the cowherds drive their cattle out to graze,\\nlike this decay and death drive out the life from beings all.",
    "136": "When the fool does evil deeds their end he does not know,\\nsuch kamma burns the one unwise as one who’s scorched by fire.",
    "137": "Whoever forces the forceless or offends the inoffensive, speedily comes indeed\\nto one of these ten states:",
    "138": "Sharp pain or deprivation, or injury to the body,\\nor to a serious disease, derangement of the mind;",
    "139": "Troubled by the government, or else false accusation,\\nor by the loss of relatives, destruction of one’s wealth;",
    "140": "Or one’s houses burn\\nin raging conflagration, at the body’s end, in hell arises that unwise one.",
    "141": "Not going naked, nor matted hair, nor filth, nor fasting, not sleeping on bare earth,\\nno penance on heels, nor sweat nor grime can purify a mortal still overcome by doubt.",
    "142": "Even though adorned, if living at peace calm, tamed, established in the holy life, for beings all laying force aside:\\none pure, one peaceful, a bhikkhu is he.",
    "143": "Where in the world is found one restrained by shame, awakened out of sleep\\nas splendid horse with whip?",
    "144": "As splendid horse touched with whip, be ardent, deeply moved,\\nby faith and virtue, effort too,\\nby meditation, Dhamma’s search,\\nby knowledge, kindness, mindfulness: abandon dukkha limitless!",
    "145": "Irrigators govern waters,\\nfletchers fashion shafts,\\nas joiners shape their timber\\nthose of good conduct tame themselves.",
    "146": "Why this laughter, why this joy, when it’s ever blazing? shrouded all about by gloom won’t you look for light?",
    "147": "See this body beautiful\\na mass of sores, a congeries,\\nmuch considered but miserable\\nwhere nothing’s stable, nothing persists.",
    "148": "All decrepit is this body, diseases’ nest and frail; this foul mass is broken up for life does end in death.",
    "149": "These dove-hued bones scattered in Fall,\\nlike long white gourds, what joy in seeing them?",
    "150": "This city’s made of bones plastered with flesh and blood, within are stored decay and death, besmearing and conceit.",
    "151": "Even rich royal chariots rot,\\nthe body too does rot, decay,\\nbut undecaying’s Dhamma of the Good who to the good declare.",
    "152": "Just as the ox grows old\\nso this man of little learning: his fleshiness increases,\\nhis wisdom doesn’t grow.",
    "153": "Through many of saüsàra’s births I hastened seeking, finding not the builder of this house:\\npain is birth again, again.",
    "154": "O builder of this house you’re seen, you shall not build a house again, all your beams have given away, rafters of the ridge decayed,\\nmind to the Unconditioned gone, exhaustion of craving has it reached.",
    "155": "Who have not led the holy life nor riches won while young, they linger on as aged cranes around a fished-out pond.",
    "156": "Who have not led the holy life nor riches won while young,\\nthey languish on, worn-out bows, sighing for the past.",
    "157": "If one holds oneself as dear, protected, one protects oneself. One who’s wise should be aware through all the watches three.",
    "158": "One should first establish oneself in what is proper. One may then teach others, and wise, one is not blamed.",
    "159": "As one teaches others\\nso should one do oneself. Well-tamed, one may others tame, oneself to tame is hard.",
    "160": "Oneself is refuge of oneself,\\nwho else indeed could refuge be? By good training of oneself\\none gains a refuge hard to gain.",
    "161": "By oneself is evil done,\\nit’s born of self and self-produced. Evil grinds the unwise one\\nas diamond does the hardest gem.",
    "162": "Hewhoseconduct’sverybad like oak-tree choked by ivy, so he does towards himself what enemies would wish.",
    "163": "Easy is what’s bad to do what’s harmful to oneself. But what is good, of benefit, is very hard to do.",
    "164": "Whatever man unwise relies\\non evil view and so condemns the Teaching of the Arahants,\\nor Noble Ones who Dhamma live, he, as a bamboo fruiting,\\nfruits to self-destruction.",
    "165": "By oneself is evil done,\\nby oneself defiled,\\nby oneself it’s left undone,\\nby self alone one purified.\\nPurity, impurity on oneself depend, no one can purify another.",
    "166": "Let none neglect their good\\nfor others’ good however great. Know well oneself’s own good and to that good attend.",
    "167": "Do not follow base desires, nor live with heedlessness, do not follow wrong beliefs to grow in worldly ways.",
    "168": "Rouse yourself, be diligent,\\nin Dhamma faring well.\\nWho dwells in Dhamma’s happy in this birth and the next.",
    "169": "Fare in Dhamma coursing well, in evil courses do not fare.\\nWho dwells in Dhamma’s happy in this birth and the next.",
    "170": "Just as a bubble may be seen, just as a faint mirage,\\nso should the world be viewed that the Death-king sees one not.",
    "171": "Come, look upon this world like to a rich, royal chariot wherein fools lounge at ease but alert ones linger not.",
    "172": "Whoso was heedless formerly but later lives with heedfulness illuminates all this world\\nas moon when free from clouds.",
    "173": "Who by wholesome kamma covers up the evil done illumines all this world\\nas moon when free from clouds.",
    "174": "This world is blind-become\\nfew are here who see within\\nas few the birds break free from net so those who go to heavens.",
    "175": "Swans upon the sun’s path fly,\\nthe powerful through space, conquering Màra and his host\\naway from the world the wise are led.",
    "176": "For one who falsely speaks, who disregards the Dhamma, who other lives denies:\\nno evil this one will not do.",
    "177": "To heavenly realms the mean don’t fare, fools magnanimity ne’er acclaim,\\nbut the one of wisdom rejoices at giving and happy will be in future lives.",
    "178": "Than o’er the earth sole sovereignty, than going unto heaven,\\nthan lordship over all the worlds: better the Stream-winner’s Fruit.",
    "179": "That Buddha traceless of infinite range whose victory none may e’er undo, whose vanquished follow to no world, then by which track will you trace him?",
    "180": "That Buddha traceless of infinite range in whom’s no entangling craving\\nand no ensnaring not anywhere leading, then by which track will you trace him?",
    "181": "E’er intent on concentration,\\njoyful in peace of letting go, mindful, wise, the perfect Buddhas, to even devas they are dear.",
    "182": "Human birth is hard to gain, hard for mortals is their life,\\nto come to Dhamma True is hard, rare the Buddhas’ arising.",
    "183": "Every evil never doing\\nand in wholesomeness increasing and one’s heart well-purifying: this is the Buddha’s Teaching.",
    "184": "Patience is the austerity supreme, Nibbana’s supreme the Buddhas say. One who irks or others harm\\nis not ordained or monk become.",
    "185": "Not reviling, neither harming, restrained to limit ‘freedom’s’ ways, knowing reason in one’s food, dwelling far in solitude,\\nand striving in the mind sublime: this is the Buddha’s Teaching.",
    "186": "Not by a rain of golden coins is found desires’ saiety,\\ndesires are dukkha, of little joy, thus a wise one understands.",
    "187": "Even with pleasures heavenly that one finds no delight,\\nthe perfect Buddha’s pupil delights in craving’s end.",
    "188": "Many a refuge do they seek\\non hills, in woods, to sacred trees, to monasteries and shrines they go, folk by fear tormented.",
    "189": "Such refuge isn’t secure,\\nsuch refuge isn’t supreme. From all dukkha one’s not free unto that refuge gone.",
    "190": "But going for refuge to Buddha, to Dhamma and the Sangha too, one sees with perfect wisdom the tetrad of the Noble Truths:",
    "191": "Dukkha, its causal arising,\\nthe overcoming of dukkha,\\nand the Eight-fold Path that’s Noble leading to dukkha’s allaying.",
    "192": "Such refuge is secure,\\nsuch refuge is supreme. From all dukkha one is free unto that refuge gone.",
    "193": "Hard to find the pure and noble who isn’t born just anywhere, wherever one so wise is born that family thrives happily.",
    "194": "Blessed is the birth of Buddhas, blest True Dhamma’s Teaching, blest the Sangha’s harmony and blessed is their striving.",
    "195": "Who venerates the venerable — the Buddhas or their hearkeners who’ve overcome the manifold, grief and lamentation left,",
    "196": "They who are ‘Thus’, venerable, cool and free from every fear — no one is able to calculate\\ntheir merit as ‘just-so-much’.",
    "197": "We the unhating live happily midst the haters, among the hating humans from hatred dwell we free.",
    "198": "We who are healthy live happily midst the unhealthy, among unhealthy humans from ill-health dwell we free.",
    "199": "We the unfrenzied live happily midst the frenzied, among the frenzied humans from frenzy dwell we free.",
    "200": "We for whom there’s nought live indeed so happily, joy-sustained we’ll be\\nlike replendent gods.",
    "201": "Victory gives rise to hate, those defeated lie in pain, happily rest the Peaceful surrendering victory-defeat.",
    "202": "There’s no fire like lust,\\nno evil like aversion,\\nno dukkha like the aggregates, no higher bliss than Peace.",
    "203": "Hunger is the greatest ill,\\nthe greatest dukkha — conditionless, knowing this really as it is:\\nNibbàna bliss supreme.",
    "204": "Health’s the greatest gain, contentment, best of wealth, trusting’s best of kin, Nibbàna bliss supreme.",
    "205": "Having drunk of solitude and tasted Peace Sublime, free from sorrow, evil-free, one drinks of Dhamma’s joy.",
    "206": "So fair’s the sight of Noble Ones, ever good their company,\\nby relating not to fools\\never happy one may be.",
    "207": "Who moves among fools’ company must truly grieve for long,\\nfor ill the company of fools\\nas ever that of foes,\\nbut weal’s a wise one’s company as meetings of one’s folk.",
    "208": "Thus go with the steadfast, wise well-versed, firm of virtue, practice-pure,\\nEnnobled ‘Such’, who’s sound, sincere,\\nas moon in wake of the Milky Way.",
    "209": "One makes an effort where none’s due with nothing done where effort’s due, one grasps the dear, gives up the Quest envying those who exert themselves.",
    "210": "Don’t consort with dear ones\\nat any time, nor those not dear, ’tis dukkha not to see the dear, ’tis dukkha seeing those not dear.",
    "211": "Others then do not make dear\\nfor hard’s the parting from them. For whom there is no dear, undear in them no bonds are found.",
    "212": "From endearment grief is born, from endearment fear,\\none who is endearment-free has no grief — how fear?",
    "213": "From affection grief is born, from affection fear,\\none who is affection-free has no grief — how fear?",
    "214": "From lustfulness arises grief, from lustfulness springs fear, one wholly free of lustfulness has no grief — how fear?",
    "215": "From attachment grief is born, from attachment fear,\\none who is attachment-free has no grief — how fear?",
    "216": "Out of craving grief is born, out of craving fear,\\none fully freed of craving has no grief — how fear?",
    "217": "Perfect in virtue and insight,\\nfirm in Dhamma, knower of Truth, dear to the people’s such a one who does what should be done.",
    "218": "One with a wish for the Undeclared, with mind so well-pervaded,\\na mind not bound in pleasures of sense, an ‘upstream-goer’s’ called.",
    "219": "One who’s long away from home returns in safety from afar,\\nthen friends, well-wishers, kinsmen too are overjoyed at his return.",
    "220": "In the same way, with merit done when from this world to another gone those merits then receive one there\\nas relatives a dear one come.",
    "221": "Anger and pride should one forsake, all fetters cast aside,\\ndukkha’s none where no desire,\\nno binding to body or mind.",
    "222": "Who checks arising anger as with chariot away,\\nthat one I call a charioteer, others merely grip the reins.",
    "223": "Anger conquer by amity,\\nevil conquer with good,\\nby giving conquer the miserly, with truth the speakers of falsity.",
    "224": "Speak truth and be not angry, from little give to one who asks, by these conditions three to go unto the prescence of the gods.",
    "225": "Those sages inoffensive\\nin body e’er restrained\\ngo unto the Deathless State where gone they grieve no more.",
    "226": "For the ever-vigilant\\nwho train by day and night upon Nibbàna e’er intent pollutions fade away.",
    "227": "An ancient saying, Atula, not only said today —\\n‘They are blamed who silent sit,\\nwho often speak they too are blamed,\\nand blamed are they of measured speech’ — there’s none in the world unblamed.",
    "228": "There never was, there’ll never be nor now is ever found\\na person blamed perpetually\\nor one who’s wholly praised.",
    "229": "But those who are intelligent\\npraise one of flawless conduct, sage, in wisdom and virtue well-composed, having observed him day by day.",
    "230": "Who’s to blame that one so fine as gem from Jambu stream? Even the devas that one praise, by Bràhma too is praised.",
    "231": "Rough action one should guard against, be with the body well-restrained,\\nbad bodily conduct having shed\\ntrain oneself in good.",
    "232": "Rough speaking one should guard against, be in speaking well-restrained,\\nbad verbal conduct having shed\\ntrain oneself in good.",
    "233": "Rough thinking one should guard against, be in thinking well-restrained,\\nbad mental conduct having shed\\ntrain oneself in good.",
    "234": "Restrained in body are the wise,\\nin speech as well they are restrained, likewise are they restrained in mind, they’re perfectly restrained.",
    "235": "Now a withered leaf you are\\nand now Death’s men draw near, now you stand at the parting gates but wayward you have none.",
    "236": "Make an island of yourself, quickly strive and wise become, freed from stain and passionless to go to the pure Abodes.",
    "237": "Even now the end draws near,\\nto the presence of death you’ve fared, along the path’s no place for rest\\nand waybred you have none.",
    "238": "Make an island of yourself, quickly strive and wise become, freed from stain and passionless you’ll not return, take flesh, decay.",
    "239": "Little by little, time after time, successively then let the sage blow away all blemishes\\njust as a smith with silver.",
    "240": "As rust arisen out of iron\\nitself that iron eats away,\\nso kammas done beyond what’s wise lead to a state of woe.",
    "241": "For oral tradition, non-recitation, in household life, non-exertion, the fair of form when slovenly,\\na sentry’s sloth: all blemishes.",
    "242": "In woman, conduct culpable, with givers, avariciousness, all blemishes these evil things in this world or the next.",
    "243": "More basic than these blemishes is ignorance, the worst of all.\\nAbandoning this blemish then, be free of blemish, monks!",
    "244": "Easy the life for a shameless one who bold and forward as a crow, is slanderer and braggart too: this one’s completely stained.",
    "245": "But hard the life of a modest one who always seeks for purity,\\nwho’s cheerful though no braggart, clean-living and discerning.",
    "246": "In the world who life destroys, who words of falsity speaks,\\nwho takes what is not freely given or to another’s partner goes.",
    "247": "Or has distilled, fermented drinks: Who with abandon follows these extirpates the roots of self\\neven here in this very world.",
    "248": "Therefore friend remember this; Hard to restrain are evil acts, don’t let greed and wickedness down drag you long in dukkha.",
    "249": "People give as they have faith,\\nas they are bright with joyfulness. Who’s troubled over gifts received, the food and drink that others get, neither in daytime nor by night will come to a collected mind.",
    "250": "But who has severed envy’s mind, uprooted it, destroyed entire, indeed in daytime and by night will come to a collected mind.",
    "251": "There is no fire like lust, nought seizes like aversion, unequalled is delusion’s net, no river’s like to craving.",
    "252": "Others’ faults are easy to see\\nyet hard it is to see one’s own,\\nand so one winnows just like chaff the faults of other people, while hiding away those of one’s own\\nas crafty cheat the losing throw.",
    "253": "Who’s always seeing other’s faults, taking offence, censorious, pollutions spread for such a one who’s far from their exhaustion.",
    "254": "In skies above there is no path, no peaceful one’s without,\\nin manifoldness do folk delight, Tathagatas are manifold-free.",
    "255": "In skies above there is no path, no peaceful one’s without, nothing conditioned ever lasts, no Buddha’s ever shaken.",
    "256": "Whoever judges hastily\\ndoes Dhamma not uphold,\\na wise one should investigate truth and untruth both.",
    "257": "Who others guide impartially with carefulness, with Dhamma, that wise one Dhamma guards, a ‘Dhamma-holder’s’ called.",
    "258": "Just because articulate\\none’s not thereby wise, hateless, fearless and secure, a ‘wise one’ thus is called.",
    "259": "Just because articulate\\none’s not skilled in Dhamma; but one who’s heard even little and Dhamma in the body sees, that one is skilled indeed,\\nnot heedless of the Dhamma.",
    "260": "A man is not an Elder though his head be grey, he’s just fully ripe in years,\\n‘aged-in-vain’ he’s called.",
    "261": "In whom is truth and Dhamma too, harmlessness, restraint, control, he’s steadfast, rid of blemishes,\\nan ‘Elder’ he is called.",
    "262": "Not by eloquence alone or by lovely countenance is a person beautiful\\nif jealous, boastful, mean.",
    "263": "But ‘beautiful’ is called that one\\nin whom these are completely shed, uprooted, utterly destroyed,\\na wise one purged of hate.",
    "264": "By shaven head no samaõa\\nif with deceit, no discipline. Engrossed in greed and selfishness how shall he be a samaõa?",
    "265": "All evils altogether he subdues both fine and gross. Having subdued all evil he indeed is called a ‘Samaõa’.",
    "266": "Though one begs from others by this alone’s no bhikkhu. Not just by this a bhikkhu but from all Dhamma doing.",
    "267": "Who both good and evil deeds\\nhas gone beyond with holy life, having discerned the world he fares and ‘Bhikkhu’ he is called.",
    "268": "By silence one is not a sage\\nif confused and foolish,\\nbut one who’s wise, as if with scales weighs, adopts what’s good.",
    "269": "Shunning evils utterly\\none is a sage, by that a sage. Whoever both worlds knows for that one’s called a ‘Sage’.",
    "270": "By harming living beings\\none is not a ‘Noble’ man,\\nby lack of harm to all that live one is called a ‘Noble One’.",
    "271": "Not by vows and rituals or again by learning much or by meditative calm\\nor by life in solitude.",
    "272": "Should you, O bhikkhu, be content, “I’ve touched the bliss of letting go\\nnot enjoyed by common folk”,\\nthough you’ve not gained pollution’s end.",
    "273": "Of paths the Eight-fold is the best, of truths the statements four,\\nthe passionless of teachings best, of humankind the Seer.",
    "274": "This is the path, noo ther’s there for purity of insight,\\nenter then upon this path bemusing Màra utterly.",
    "275": "Entered then upon this path\\nyou’ll make an end of dukkha.\\nFreed in knowledge from suffering’s stings the Path’s proclaimed by me.",
    "276": "Buddhas just proclaim the Path but you’re the ones to strive. Contemplatives who tread the Path are freed from Màra’s bonds.",
    "277": "When with wisdom one discerns transience of conditioned things one wearily from dukkha turns treading the path to purity.",
    "278": "When with wisdom one discerns the dukkha of conditioned things one wearily from dukkha turns treading the path to purity.",
    "279": "When with wisdom one discerns all knowables are not a self\\none wearily from dukkha turns treading the path to purity.",
    "280": "Though time to strive, not striving, while young and strong yet indolent, weak-minded and irresolute:\\none finds not wisdom’s way.",
    "281": "In speech ever watchful with mind well-restrained never with the body do unwholesomeness.\\nSo should one purify these three kamma-paths winning to the Way made known by the Seers.",
    "282": "From endeavour wisdom springs, lacking effort wisdom wanes: having known this two-fold path either to progress or decline\\nso should one exhort oneself that wisdom may increase.",
    "283": "The wood cut down but not a tree since it’s from wood that fear is born. Having cut wood and woodedness O bhikkhås be without a wood.",
    "284": "As long indeed as woodedness of man to woman is not cut\\nso long in bondage is one’s mind as milch-calf to the mother cow.",
    "285": "Cut off affection for oneself\\nas hand a lily in the Fall. Cultivate this peaceful path, Nibbàna by the Buddha taught.",
    "286": "Here shall I spend the Rains,\\nhere the Winter, here the Summer. Thus speculates the fool,\\nthe danger he knows not.",
    "287": "For one who has a clinging mind and finds delight in babes and herds Death does seize and carry away\\nas great flood a sleeping village.",
    "288": "No sons are there for shelter\\nnor father nor related folk,\\none by the Death-king seized upon in kin no shelter finds.",
    "289": "Having understood this fact\\nthe wise by virtue well-restrained swiftly then should clear the path leading to Nibbàna.",
    "290": "If one should see great happiness in giving up small happiness\\none wise the lesser would renounce the greater full-discerning.",
    "291": "Who so for self wants happiness by causing others pain, entangled in anger’s tangles one’s from anger never free.",
    "292": "What should be done is left undone and done is what should not be done, ever the pollutions grow\\nof those ones proud and heedless.",
    "293": "But those who always practise well bodily mindfulness,\\ndo never what should not be done and ever do what should be done, for mindful ones, the full-aware, pollutions fade away.",
    "294": "One’s mother and father having slain and then two warrior kings,\\na realm as well its treasurer,\\none goes immune, a Brahmin True.",
    "295": "One’s mother and father having slain and then two learned kings,\\nas well the fifth, a tiger fierce,\\none goes immune, a Brahmin True.",
    "296": "Well awakened, they’re awake ever the Buddha’s pupils\\nwho constantly by day, by night are mindful of the Buddha.",
    "297": "Well awakened, they’re awake ever the Buddha’s pupils\\nwho constantly by day, by night are mindful of the Dhamma.",
    "298": "Well awakened, they’re awake ever the Buddha’s pupils\\nwho constantly by day, by night are mindful of the Sangha.",
    "299": "Well awakened, they’re awake ever the Buddha’s pupils\\nwho constantly by day, by night are mindful of the body.",
    "300": "Well awakened, they’re awake ever the Buddha’s pupils\\nwho constantly by day, by night in harmlessness delight.",
    "301": "Well awakened, they’re awake ever the Buddha’s pupils\\nwho constantly by day, by night in meditation take delight.",
    "302": "Hard’s the going forth, hard to delight in it, hard’s the household life and dukkha is it too, Dukkha’s to dwell with those dissimilar\\nand dukkha befalls the wanderer.\\nBe therefore not a wanderer, not one whom dukkha befalls.",
    "303": "Who’s full of faith and virtue, of substance, high repute,\\nis honoured everywhere, wherever that one goes.",
    "304": "Afar the true are manifest\\nlike Himàlayan range,\\nyet even here the false aren’t seen, they’re arrows shot by night.",
    "305": "Alone one sits, alone one lies, alone one walks unweariedly,\\nin solitude one tames oneself\\nso in the woods will one delight.",
    "306": "With one denying truth there goes to hell that one who having done says ‘I did not’. Both of them in making kammas base are equal after death.",
    "307": "Many who wear the yellow robe are unrestrained in evil things, these evil ones by evil deeds\\nin hell do they arise.",
    "308": "Better to eat a ball of iron\\nglowing as flame of fire\\nthan one should eat the country’s alms immoral and unrestrained.",
    "309": "Four things befall that heedless one sleeping with one who’s wed: demerit gained but not good sleep, third is blame while fourth is hell.",
    "310": "Demerit’s gained and evil birth,\\nscared man and woman — brief their joy, the king decrees a heavy doom:\\nso none should sleep with one who’s wed.",
    "311": "As blady grass when wrongly grasped the hand does lacerate\\nso a mishandled monastic life\\ndrags one off to hell.",
    "312": "Whatever of kammas slack, whatever of vows corrupt, a faltering in the holy life never brings ample fruit.",
    "313": "If there’s aught that should bedone let it be done then steadily,\\nin truth a slack monastic life\\nall the more stirs up the dust.",
    "314": "Better an evil deed not done for misdeed later on torments. Better done is deed that’s good, which done, does not torment.",
    "315": "Even as a border town\\nguarded within and without,\\nso should you protect yourselves.\\nDo not let this moment pass\\nfor when this moment’s gone they grieve sending themselves to hell.",
    "316": "They are ashamed where shame is not but where is shame are not ashamed, so by embracing evil views\\nbeings go to an evil birth.",
    "317": "They are afraid where there is not but where is fear are unafraid,\\nso by embracing evil views beings go to an evil birth.",
    "318": "Faults they see where fault is not but where is fault they see it not, so by embracing evil views beings go to an evil birth.",
    "319": "A fault they understand as such, they know as well where fault is not, so by embracing righteous views being go to a happy birth.",
    "320": "Many folk are ill-behaved\\nbut I shall endure abuse\\nas an elephant on the battlefield arrows shot from a bow.",
    "321": "The tusker tamed they lead in crowds, the king he mounts the tamed, noblest of humans are the tamed\\nwho can endure abuse.",
    "322": "Excellent are mules when tamed and thoroughbreds from Sindh, noble the elephants of state, better still one tamed of self.",
    "323": "Surely not on mounts like these one goes the Unfrequented Way as one by self well-tamed\\nis tamed and by the taming goes.",
    "324": "Hard to check the tusker Dhanapàlaka,\\nin rut with temples running pungently, bound, e’en a morsel he’ll not eat\\nfor he recalls the elephant-forest longingly.",
    "325": "A sluggard stupid, steeped in gluttony,\\nwho’s sleep-engrossed, who wallows as he lies, like a great porker stuffed, engorged with swill, comes ever and again into a womb.",
    "326": "Formerly this wandering mind wandered\\nwhere it wished, where whim, where pleasure led. Wisely this day will I restrain it\\nas trainer with hook an elephant in rut.",
    "327": "Do you delight in heedfulness\\nand guard your own minds well! Draw yourselves from the evil way as would elephant sunk in slough.",
    "328": "If for practice one finds a friend prudent, well-behaved and wise, mindful, joyful, live with him all troubles overcoming.",
    "329": "If for practice one finds not friend prudent, well-behaved and wise, like king be leaving conquered land, fare as lone elephant in the wilds.",
    "330": "Better it is to live alone\\nfor with a fool’s no fellowship, no evils do, be free of care,\\nfare as lone elephant in the wilds.",
    "331": "Blest to have friends when one’s in need, blest contentment with whatever is, blessed is merit when life’s at an end, abandoning all dukkha is blessedness.",
    "332": "Respect for one’s mother brings happiness here as well as respect for one’s father.\\nHere happiness comes from respecting the monks and those of virtue excellent.",
    "333": "Blest is virtue till life’s end\\nand blest the faith standing firm, blest the attainment of wisdom and blest the non-doing of evils.",
    "334": "As creeping ivy craving grows\\nin one living carelessly.\\nLike this, one leaps from life to life as ape in the forest seeking fruit.",
    "335": "Whomsoever in the world\\nthis wretched clinging craving routs for such a one do sorrows grow\\nas grass well-soaked with rain.",
    "336": "But whoever in the world\\nrouts wretched craving hard to quell, from such a one do sorrows fall\\nlike water drops from lotus leaf.",
    "337": "Prosperity to you,Isay,\\nto all assembled here!\\nWhen needing grass’s fragrant root so craving extirpate.\\nDon’t let Màra break you again, again as a torrent a reed!",
    "338": "As tree though felled shoots up again if its roots are safe and firm\\nso this dukkha grows again\\nwhile latent craving’s removed.",
    "339": "For whom the six and thirty streams so forceful flow to seemings sweet floods of thought that spring from lust sweep off such wrong viewholder.",
    "340": "Everywhere these streams are swirling, up-bursting creepers rooted firm. Seeing the craving-creeper there\\nwith wisdom cut its root!",
    "341": "To beings there are pleasures streaming sticky with desire,\\nsteeped in comfort, happiness seeking, such ones do come to birth, decay.",
    "342": "Who follow craving are assailed, they tremble as the hare ensnared, held fast by fetters and by bonds\\nso long they come to dukkha again.",
    "343": "Who follow craving are assailed, they tremble as the hare ensnared, so let a bhikkhu craving quell whose aim is passionlessness.",
    "344": "Who without woodness inclines to the wood, free in the wood to woodness returns.\\nDo now regard that person well\\nwho free returns to fetters.",
    "345": "Neither of iron nor wood nor hemp is bond so strong, proclaim the wise, as passion’s yearn for sons, for wives, for gems and ornaments.",
    "346": "That bond is strong, proclaim the wise, down-dragging, pliable, hard to loose. This passion severed, they wander forth forsaking sensual pleasures.",
    "347": "Ensnared in passion back they fall\\nas spider on a self-spun web.\\nThis passion severed, wander the wise forsaking dukkha all.",
    "348": "Let go before, let go the after,\\nlet go the middle, beyond becoming. With mind released in every way you’ll come no more to birth, decay.",
    "349": "For one who’s crushed by thinking much excessive lust from beauty’s sight,\\nfor that one craving grows the more, that one makes strong the bonds.",
    "350": "But who delights in calming thoughts develops foulness mindfully,\\nthat one indeed will make an End, will sever Mara’s bonds.",
    "351": "One who’s fearless, reached the End,\\nof craving and of blemish free,\\nwho has becoming’s thorn plucked out, has this, a final body.",
    "352": "One of clinging-craving free,\\nwho’s skilled in ways of chanting, knowing the wording-sequence,\\nof what precedes and follows, possessed of final body,\\none greatly wise, ‘Great Person’ is called.",
    "353": "Beyond all being, wise to all, unsoiled by dhammas all am I,\\nleft all and freed by craving’s end,\\nby self I’ve known, whom teacher call?",
    "354": "Gift of Dhamma surpasses all gifts,\\nthe Dhamma, its taste all other tastes beats, delight in the Dhamma bests other delights, destruction of craving conquers all ill.",
    "355": "Riches ruin a foolish one\\nbut not one seeking the Further Shore, craving for wealth a foolish one\\nis ruined as if ruining others.",
    "356": "Weeds are a fault of fields, lust’s a human fault,\\nthus offerings to the lustless bear abundant fruit.",
    "357": "Weeds are a fault of fields, hate’s a human fault,\\nhence offerings to the hateless bear abundant fruit.",
    "358": "Weeds are a fault of fields, delusion, human’s fault, so gifts to the undeluded bear abundant fruit.",
    "359": "Weeds are a fault of fields, desire’s a human fault,\\nso gifts to the desireless bear abundant fruit.",
    "360": "Right is restraint in the eye, restraint in the ear is right, right is restraint in the nose, restraint in the tongue is right.",
    "361": "Right is restraint in the body, restraint in speech is right,\\nright is restraint in the mind, everywhere restraint is right.\\nThe bhikkhu everywhere restrained is from all dukkha free.",
    "362": "With hands controlled and feet controlled, in speech as well as head controlled, delighting in inward collectedness\\nalone, content, a bhikkhu’s called.",
    "363": "Whatever bhikkhu tongue-controlled speaks wisely and who is not proud, who theory and practice can expound, sweet as honey is his speech.",
    "364": "The bhikkhu who in Dhamma dwells, in Dhamma delighting and pondering, remembering the Dhamma — he\\ndoes not decline from Dhamma true.",
    "365": "He should not disdain his gains nor life of others envious,\\nthe bhikkhu who is envious does not attain collectedness.",
    "366": "Disdaining not his gains, though little he receives, pure of life and keen\\nthat bhikkhu devas praise.",
    "367": "For whom there is no making ‘mine’ towards all name and form,\\nwho does not grieve for what is not, he’s truly ‘bhikkhu’ called.",
    "368": "The bhikkhu in kindness abiding, bright in the Buddha’s Teaching can come to the Place of Peace,\\nthe bliss of conditionedness ceased.",
    "369": "O bhikkhu bail this boat,\\nwhen emptied it will swiftly go. Having severed lust and hate thus to Nibbàna you’ll go.",
    "370": "Five cut off and five forsake,\\na further five then cultivate,\\na bhikkhu from five fetters free is called a ‘Forder of the flood’.",
    "371": "Meditate bhikkhu! Don’t be heedless! Don’t let pleasures whirl the mind! Heedless, do not gulp a glob of iron! Bewail not when burning, ‘This is dukkha’!",
    "372": "No concentration wisdom lacks, no wisdom concentration lacks, in whom are both these qualities near to Nibbàna is that one.",
    "373": "The bhikkhu gone to a lonely place who is of peaceful heart\\nin-sees Dhamma rightly,\\nknows all-surpassing joy.",
    "374": "Whenever one reflects\\non aggregates’ arise and fall one rapture gains and joy.\\n’Tis Deathlessness for Those-who-know.",
    "375": "Here’s indeed the starting-point for the bhikkhu who is wise, sense-controlled, contented too, restrained to limit freedom ways, in company of noble friends who’re pure of life and keen.",
    "376": "One should be hospitable\\nand skilled in good behaviour, thereby greatly joyful\\ncome to dukkha’s end.",
    "377": "Just as the jasmine sheds its shrivelled flowers all, O bhikkhus so should you lust, aversion shed.",
    "378": "That bhikkhu calmed of body, speech, calmed and well-composed of mind, who world-enjoyments has renounced,\\n‘one calmed’ indeed is truly called.",
    "379": "By yourself exhort yourself!\\nBy yourself restrain yourself!\\nSo mindful and self-guarded too, happily, bhikkhu, will you live.",
    "380": "Oneself is refuge of oneself\\nand one is haven for oneself, therefore one should check oneself as merchant with a splendid horse.",
    "381": "The bhikkhu full of joy and faith, bright in the Buddha’s Teaching can come to the Place of Peace,\\nthe bliss of conditionedness ceased.",
    "382": "Surely that youthful bhikkhu who strives in the Buddha’s Teaching illumines all this world\\nas moon when freed from clouds.",
    "383": "O brahmin, strive and cleave the stream, desires of sense discard,\\nknowing conditioned things decay\\nbe Knower-of-the-Uncreate.",
    "384": "When by the twofold Dhamma\\na Brahmin’s gone beyond\\nall the bonds of One-who-Knows have wholly disappeared.",
    "385": "For whom is found no near or far, for whom’s no near and far,\\nfree of fear and fetter-free,\\nthat one I call a Brahmin True.",
    "386": "Seated stainless, concentrated,\\nwho’s work is done, who’s free of taint, having attained the highest aim,\\nthat one I call a Brahmin True.",
    "387": "The sun is bright by day,\\nthe moon enlights the night, armoured shines the warrior, contemplative the Brahmin True. But all the day and night-time too resplendent does the Buddha shine.",
    "388": "By barring-out badness a ‘brahmin’ one’s called and one is a monk by conduct serene, banishing blemishes out of oneself\\ntherefore one’s known as ‘one who’s left home’.",
    "389": "One should not a Brahmin beat\\nnor for that would He react.\\nShame! Who would a Brahmin beat, more shame for any should they react.",
    "390": "For brahmin no small benefit\\nwhen mind’s aloof from what is dear.\\nAs much he turns away from harm so much indeed does dukkha die.",
    "391": "In whom is no wrong-doing by body, speech or mind,\\nin these three ways restrained, that one I call a Brahmin True.",
    "392": "From whom one knows the Dhamma by Perfect Buddha taught\\ndevoutly one should honour them\\nas brahmin sacred fire.",
    "393": "By birth one is no brahmin,\\nby family, austerity.\\nIn whom are truth and Dhamma too pure is he, a Brahmin’s he.",
    "394": "Dimwit! What’s the coiled hair for? For what your cloak of skins? Within you are acquisitive,\\nyou decorate without!",
    "395": "One enduring rag-robes, lean, with body o’erspread by veins, lone in the woods who meditates, that one I call a Bràhmin True.",
    "396": "I call him not a brahmin though by womb-born mother’s lineage, he’s just supercilious\\nif with sense of ownership, owning nothing and unattached: that one I call a Brahmin True.",
    "397": "Who fetters all has severed\\ndoes tremble not at all,\\nwho’s gone beyond all bonds, unyoked, that one I call a Brahmin True.",
    "398": "When cutting strap and reins, the rope and bridle too, tipping the shaft, he’s Waked, that one I call a Brahmin True.",
    "399": "Who angerless endures abuse,\\nbeating and imprisonment,\\nwith patience’s power, an armed might: that one I call a Brahmin True.",
    "400": "Who’s angerless and dutiful,\\nof virtue full and free of lust, who’s tamed, to final body come, that one I call a Brahmin True.",
    "401": "Like water on a lotus leaf,\\nor mustard seed on needle point, whoso clings not to sensual things, that one I call a Brahmin True.",
    "402": "Whoso in this world comes to know cessation of all sorrow,\\nlaid down the burden, freed from bonds, that one I call a Brahmin True.",
    "403": "Whose knowledge is deep, who’s wise, who’s skilled in ways right and wrong, having attained the highest aim,\\nthat one I call a Brahmin True.",
    "404": "Aloof alike from laity\\nand those gone forth to homelessness, who wanders with no home or wish, that one I call a Brahmin True.",
    "405": "Who blows to beings has renounced to trembling ones, to bold,\\nwho causes not to kill nor kills\\nthat one I call a Brahmin True.",
    "406": "Among the hostile, friendly, among the violent, cool, detached amidst the passionate, that one I call a Brahmin True.",
    "407": "From whomever lust and hate, conceit, contempt have dropped away, as mustard seed from a needle point, that one I call a Brahmin True.",
    "408": "Who utters speech instructive, true and gentle too,\\nwho gives offence to none, that one I call a Brahmin True.",
    "409": "Who in the world will never take what is not given, long or short, the great or small, the fair or foul, that one I call a Brahmin True.",
    "410": "In whom there are no longings found in this world or the next,\\nlongingless and free from bonds, that one I call a Brahmin True.",
    "411": "In whom is no dependence found,\\nwith Final Knowledge freed from doubt, who’s plunged into the Deathless depths, that one I call a Brahmin True.",
    "412": "Here who’s gone beyond both bonds to goodness and to evil too,\\nis sorrowless, unsullied, pure,\\nthat one I call a Brahmin True.",
    "413": "Who, like the moon, unblemished, pure, is clear and limpid, and in whom delight in being is consumed,\\nthat one I call a Brahmin True.",
    "414": "Who’s overpassed this difficult path, delusion’s bond, the wandering-on, who’s crossed beyond, contemplative, uncraving with no questioning doubt, that one I call a Brahmin True.",
    "415": "Who has abandoned lusting here\\nas homeless one renouncing all, with lust and being quite consumed, that one I call a Brahmin True.",
    "416": "Who has abandoned lusting here\\nas homeless one renouncing all, with lust and being quite consumed, that one I call a Brahmin True.",
    "417": "Abandoned all the human bonds and gone beyond the bonds of gods, unbound one is from every bond, that one I call a Brahmin True.",
    "418": "Abandoned boredom and delight, become quite cool and assetless, a hero, All-worlds-Conqueror, that one I call a Brahmin True.",
    "419": "Who knows how clutching creatures die to reappear in many a mode, unclutching then, sublime, Awake,\\nthat one I call a Brahmin True.",
    "420": "Whose destination is unknown to humans, spirits or to gods, pollutions stayed, an Arahant, that one I call a Brahmin True.",
    "421": "That one who’s free of everything that’s past, that’s present, yet to be, who nothing owns, who’s unattached, that one I call a Brahmin True.",
    "422": "One noble, most excellent, heroic too, great sage and one who conquers all, who’s faultless, washed, one Awake, that one I call a Brahmin True.",
    "423": "Who so does know of former lives\\nand sees the states of bliss and woe\\nand then who’s reached the end of births, a sage supreme with wisdom keen, complete in all accomplishments,\\nthat one I call a Brahmin True."
}